#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает договоры контрагента по ИНН.
//
// Параметры:
//  ИНН - Строка
//
// Возвращаемое значение:
//  ТаблицаЗначений:
//    * Ссылка - СправочникСсылка.Example_Договоры
//    * Наименование - Строка
//    * Номер - Строка
//    * Дата - Дата
//
Функция ДоговорыКонтрагента(ИНН) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Example_Договоры.Ссылка КАК Ссылка,
	|	Example_Договоры.Наименование КАК Наименование,
	|	Example_Договоры.Номер КАК Номер,
	|	Example_Договоры.Дата КАК Дата
	|ИЗ
	|	Справочник.Example_Договоры КАК Example_Договоры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Example_Контрагенты КАК Example_Контрагенты
	|		ПО Example_Договоры.Владелец = Example_Контрагенты.Ссылка
	|ГДЕ
	|	Example_Контрагенты.ИНН = &ИНН
	|	И НЕ Example_Контрагенты.Недействителен
	|	И НЕ Example_Договоры.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ИНН", ИНН);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

#КонецОбласти
	
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
