
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает настройки HTTP-сервиса.
//
// Параметры:
//  HTTPСервис - СправочникСсылка.HTTPСервисы
//
// Возвращаемое значение:
//  Структура, Неопределено
//
Функция НастройкиHTTPСервиса(HTTPСервис) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("HTTPСервис", HTTPСервис);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	HTTPСервисы.Включен КАК Включен,
		|	HTTPСервисы.Идентификатор КАК Идентификатор,
		|	HTTPСервисы.Схема КАК Схема
		|ИЗ
		|	Справочник.HTTPСервисы КАК HTTPСервисы
		|ГДЕ
		|	HTTPСервисы.Ссылка = &HTTPСервис
		|	И НЕ HTTPСервисы.ПометкаУдаления
		|	И НЕ HTTPСервисы.ЭтоГруппа";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	НастройкиHTTPСервиса = НовыйНастройкиHTTPСервиса();
	ЗаполнитьЗначенияСвойств(НастройкиHTTPСервиса, Выборка);
	Возврат НастройкиHTTPСервиса;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Конструкторы

// Конструктор новых настроек HTTP-сервиса.
//
// Возвращаемое значение:
//  Структура:
//    * Включен - Булево
//    * Идентификатор - Строка
//    * Схема - СправочникСсылка.СхемыHTTPСервисов
//
Функция НовыйНастройкиHTTPСервиса()
	
	НастройкиHTTPСервиса = Новый Структура;
	НастройкиHTTPСервиса.Вставить("Включен", Ложь);
	НастройкиHTTPСервиса.Вставить("Идентификатор", "");
	НастройкиHTTPСервиса.Вставить("Схема", Справочники.СхемыHTTPСервисов.ПустаяСсылка());
	Возврат НастройкиHTTPСервиса;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
