
#Область СлужебныйПрограммныйИнтерфейс

// Проверяет, что в переданной коллекции (Структура, Соответствие) есть указанное свойство.
//
// Параметры:
//  Коллекция - Структура, Соответствие
//  Свойство - Строка
//
// Возвращаемое значение:
//  Булево
//
Функция ЕстьСвойствоКоллекцииКлючЗначение(Коллекция, Свойство) Экспорт
	
	Если ЭтоСтруктура(Коллекция) Тогда
		КлючУникальности = Новый УникальныйИдентификатор;
		СтруктураРеквизита = Новый Структура(Свойство, КлючУникальности);
		ЗаполнитьЗначенияСвойств(СтруктураРеквизита, Коллекция);
		Возврат СтруктураРеквизита[Свойство] <> КлючУникальности;
	ИначеЕсли ЭтоСоответствие(Коллекция) Тогда
		// TODO - Костыль
		Для Каждого КлючЗначение Из Коллекция Цикл
			Если КлючЗначение.Ключ = Свойство Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; // BSLLS:IfElseIfEndsWithElse-off
	
	Возврат Ложь;
	
КонецФункции

// Возвращает значение свойства коллекции ключ и значение по ключу.
// Если ключ не найден, возвращает значение по умолчанию.
//
// Параметры:
//  Коллекция - Структура, Соответствие
//  Ключ - Строка, Произвольный
//  ЗначениеПоУмолчанию - Произвольный
//
// Возвращаемое значение:
//  Произвольный
//
Функция ЗначениеСвойстваКоллекцииКлючЗначение(Коллекция, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Если ЭтоСтруктура(Коллекция) Тогда
		Возврат ЗначениеСвойстваСтруктуры(Коллекция, Ключ, ЗначениеПоУмолчанию);
	ИначеЕсли ЭтоСоответствие(Коллекция) Тогда
		Возврат ЗначениеСвойстваСоответствия(Коллекция, Ключ, ЗначениеПоУмолчанию);
	КонецЕсли; // BSLLS:IfElseIfEndsWithElse-off
	
	Возврат ЗначениеПоУмолчанию;
	
КонецФункции

// Возвращает значение свойства соответствия по ключу.
// Если ключ не найден, возвращает значение по умолчанию.
//
// Параметры:
//  Соответствие - Соответствие
//  Ключ - Произвольный
//  ЗначениеПоУмолчанию - Произвольный
// 
// Возвращаемое значение:
//  Произвольный
//
Функция ЗначениеСвойстваСоответствия(Соответствие, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Если НЕ ЭтоСоответствие(Соответствие) Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Значение = Соответствие.Получить(Ключ);
	
	Если Значение = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

// Возвращает значение свойства структуры по ключу.
// Если ключ не найден, возвращает значение по умолчанию.
//
// Параметры:
//  Структура - Структура
//  Ключ - Строка
//  ЗначениеПоУмолчанию - Произвольный
//
// Возвращаемое значение:
//  Произвольный
//
Функция ЗначениеСвойстваСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Если НЕ ЭтоСтруктура(Структура) Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Значение = Неопределено;
	
	Если НЕ Структура.Свойство(Ключ, Значение) Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

// Фиксирует коллекцию (Структура, Соответствие, Массив).
//
// Параметры:
//  Коллекция - Соответствие, Структура, Массив
//
// Возвращаемое значение:
//  ФиксированноеСоответствие, ФиксированнаяСтруктура, ФиксированныйМассив
//
Функция ФиксироватьКоллекцию(Коллекция) Экспорт
	
	Тип = ТипЗнч(Коллекция);
	
	Если Тип = Тип("Соответствие") Тогда
		Результат = Новый ФиксированноеСоответствие(Коллекция);
	ИначеЕсли Тип = Тип("Структура") Тогда
		Результат = Новый ФиксированнаяСтруктура(Коллекция);
	ИначеЕсли Тип = Тип("Массив") Тогда
		Результат = Новый ФиксированныйМассив(Коллекция);
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Невозможно фиксировать значение с типом %1.'"), Тип);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что переданое значение является массивом.
//
// Параметры:
//  Значение - Произвольный
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоМассив(Значение) Экспорт
	
	Возврат ТипЗнч(Значение) = Тип("Массив")
		ИЛИ ТипЗнч(Значение) = Тип("ФиксированныйМассив");
	
КонецФункции

// Проверяет, что переданое значение является структурой.
//
// Параметры:
//  Значение - Произвольный
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоСтруктура(Значение) Экспорт
	
	Возврат ТипЗнч(Значение) = Тип("Структура")
		ИЛИ ТипЗнч(Значение) = Тип("ФиксированнаяСтруктура");
	
КонецФункции

// Проверяет, что переданое значение является соответствием.
//
// Параметры:
//  Значение - Произвольный
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоСоответствие(Значение) Экспорт
	
	Возврат ТипЗнч(Значение) = Тип("Соответствие")
		ИЛИ ТипЗнч(Значение) = Тип("ФиксированноеСоответствие");
	
КонецФункции

// Проверяет, что переданое значение является коллекцией (Структура, Соответствие, Массив).
//
// Параметры:
//  Значение - Произвольный
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоКоллекция(Значение) Экспорт
	
	Возврат ЭтоКоллекцияКлючЗначение(Значение)
		ИЛИ ЭтоМассив(Значение);
	
КонецФункции

// Проверяет, что переданое значение является коллекцией с ключем и значением (Структура, Соответствие).
//
// Параметры:
//  Значение - Произвольный
// 
// Возвращаемое значение:
//  Булево
//
Функция ЭтоКоллекцияКлючЗначение(Значение) Экспорт
	
	Возврат ЭтоСтруктура(Значение)
		ИЛИ ЭтоСоответствие(Значение);
	
КонецФункции

#КонецОбласти
