
#Область ОбработчикиСобытийФормы

// Обработчик события формы "ПриСозданииНаСервере".
//
// Параметры:
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьИдентификаторы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Обработчик события "ПриИзменении" поля "Схема".
//
// Параметры:
//  Элемент - ПолеФормы
//
&НаКлиенте
Процедура СхемаПриИзменении(Элемент)
	
	ЗаполнитьИдентификаторы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет список выбора поля "Идентификатор".
//
&НаСервере
Процедура ЗаполнитьИдентификаторы()
	
	Идентификаторы = ИдентификаторыСхемы(Объект.Схема);
	Элементы.Идентификатор.СписокВыбора.Очистить();
	Элементы.Идентификатор.СписокВыбора.ЗагрузитьЗначения(Идентификаторы);
	Элементы.Идентификатор.СписокВыбора.СортироватьПоЗначению();
	
КонецПроцедуры

// см. Справочники.СхемыHTTPСервисов.ИдентификаторыСхемы
//
&НаСервереБезКонтекста
Функция ИдентификаторыСхемы(Знач СхемаHTTPСервисов)
	
	Возврат Справочники.СхемыHTTPСервисов.ИдентификаторыСхемы(СхемаHTTPСервисов);
	
КонецФункции

#КонецОбласти
