
#Область ПрограммныйИнтерфейс

// Обрабатывает HTTP-сервис запрос и возвращает подготовленный HTTP-сервис ответ.
// Необходимо вызывать из обработчика HTTP-сервиса.
//
// Параметры:
//  HTTPСервисЗапрос - HTTPСервисЗапрос - Входящий запрос
//  HTTPСервис - СправочникСсылка.HTTPСервисы - HTTP-сервис
//
// Возвращаемое значение:
//  HTTPСервисОтвет - Подготовленный ответ
//
// Пример:
//  Функция Demo(HTTPСервисЗапрос)
//      HTTPСервис = Справочники.HTTPСервисы.Demo;
//      Возврат HTTPСервисЗапросы.ОбработатьЗапрос(HTTPСервисЗапрос, HTTPСервис);
//  КонецФункции
//
Функция ОбработатьЗапрос(HTTPСервисЗапрос, HTTPСервис) Экспорт
	
	Возврат HTTPСервисЗапросыСлужебный.ВыполнитьОбработку(HTTPСервисЗапрос, HTTPСервис);
	
КонецФункции

#КонецОбласти
