
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

// Контекст обработчика.
Перем Контекст;

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает текущий HTTP-сервис.
//
// Возвращаемое значение:
//  СправочникСсылка.HTTPсервисы - HTTP-сервис
//
Функция HTTPСервис() Экспорт
	
	Возврат Контекст.HTTPСервис;
	
КонецФункции

// Возвращает идентификатор запроса в логе HTTP запросов.
//
// Возвращаемое значение:
//  Строка - Идентификатор запроса
//
Функция ИдентификаторЗапроса() Экспорт
	
	Возврат Контекст.ИдентификаторЗапроса;
	
КонецФункции

// Возвращает базовую часть URL запроса, включая имя сервиса.
//
// Возвращаемое значение:
//  Строка - Базовый URL
//
Функция БазовыйURL() Экспорт
	
	Возврат Контекст.Запрос.БазовыйURL;
	
КонецФункции

// Возвращает внешний идентификатор запроса.
// Получается из заголовка запроса 'X-Request-ID'.
//
// Возвращаемое значение:
//  Строка - Внешний идентификатор запроса
//
Функция ВнешнийИдентификатор() Экспорт
	
	Возврат Контекст.Запрос.ВнешнийИдентификатор;
	
КонецФункции

// Проверяет наличие заголовка запроса.
//
// Параметры:
//  Имя - Строка - Имя заголовка
//
// Возвращаемое значение:
//  Булево - Есть заголовок
//
Функция ЕстьЗаголовок(Имя) Экспорт
	
	Возврат ЗначениеСвойства(Контекст.Запрос.Заголовки, Имя) <> Неопределено;
	
КонецФункции

// Проверяет наличие параметра запроса.
//
// Параметры:
//  Имя - Строка - Имя параметра запроса
//
// Возвращаемое значение:
//  Булево - Есть параметр запроса
//
Функция ЕстьПараметрЗапроса(Имя) Экспорт
	
	Возврат ЗначениеСвойства(Контекст.Запрос.ПараметрыЗапроса, Имя) <> Неопределено;
	
КонецФункции

// Возвращает значение заголовка запроса.
//
// Параметры:
//  Имя - Строка - Имя заголовка
//
// Возвращаемое значение:
//  - Строка - Значение заголовка
//  - Неопределено - Если заголовок не найден
//
Функция Заголовок(Имя) Экспорт
	
	Возврат ЗначениеСвойства(Контекст.Запрос.Заголовки, Имя);
	
КонецФункции

// Возвращает заголовки запроса.
//
// Возвращаемое значение:
//  ФиксированноеСоответствие - Заголовки
//
Функция Заголовки() Экспорт
	
	Возврат Коллекции.ФиксироватьКоллекцию(Контекст.Запрос.Заголовки);
	
КонецФункции

// Возвращает HTTP-метод запроса в верхнем регистре.
//
// Возвращаемое значение:
//  Строка - HTTP-метод
//
Функция Метод() Экспорт
	
	Возврат ВРег(Контекст.Запрос.Метод);
	
КонецФункции

// Возвращает оригинальный HTTP-сервис запрос.
//
// Возвращаемое значение:
//  HTTPСервисЗапрос - Оригинальный запрос
//
Функция ОригинальныйЗапрос() Экспорт
	
	Возврат Контекст.HTTPСервисЗапрос;
	
КонецФункции

// Возвращает относительную часть URL-адреса.
//
// Возвращаемое значение:
//  Строка - Относительный URL
//
Функция ОтносительныйURL() Экспорт
	
	Возврат Контекст.Запрос.ОтносительныйURL;
	
КонецФункции

// Возвращает значение параметра URL.
//
// Параметры:
//  Имя - Строка - Имя параметра
//
// Возвращаемое значение:
//  - Строка - Значение параметра
//  - Неопределено - Если параметр не найден
//
Функция ПараметрURL(Имя) Экспорт
	
	Возврат ЗначениеСвойства(Контекст.Запрос.ПараметрыURL, Имя);
	
КонецФункции

// Возвращает значение параметра запроса.
//
// Параметры:
//  Имя - Строка - Имя параметра
//
// Возвращаемое значение:
//  - Строка - Значение параметра
//  - Неопределено - Если параметр не найден
//
Функция ПараметрЗапроса(Имя) Экспорт
	
	Возврат ЗначениеСвойства(Контекст.Запрос.ПараметрыЗапроса, Имя);
	
КонецФункции

// Возвращает параметры URL.
//
// Возвращаемое значение:
//  ФиксированноеСоответствие - Параметры URL
//
Функция ПараметрыURL() Экспорт
	
	Возврат Коллекции.ФиксироватьКоллекцию(Контекст.Запрос.ПараметрыURL);
	
КонецФункции

// Возвращает параметры запроса.
//
// Возвращаемое значение:
//  ФиксированноеСоответствие - Параметры запроса
//
Функция ПараметрыЗапроса() Экспорт
	
	Возврат Коллекции.ФиксироватьКоллекцию(Контекст.Запрос.ПараметрыЗапроса);
	
КонецФункции

// Возвращает тело запроса в виде двоичных данных.
//
// Возвращаемое значение:
//  ДвоичныеДанные - Тело запроса
//
Функция ТелоКакДвоичныеДанные() Экспорт
	
	Возврат Контекст.Запрос.ТелоКакДвоичныеДанные;
	
КонецФункции

// Возвращает тело запроса в виде строки.
//
// Возвращаемое значение:
//  Строка - Тело запроса
//
Функция ТелоКакСтрока() Экспорт
	
	Возврат Контекст.Запрос.ТелоКакСтрока;
	
КонецФункции

// Возвращает тело запроса в виде объекта прочитанного из JSON.
//
// Возвращаемое значение:
//  - Массив, Структура, Соответствие - Тело запроса
//
Функция ТелоКакОбъект() Экспорт
	
	Возврат Контекст.Запрос.ТелоКакОбъект;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает значение свойства по ключу без учета регистра ключа.
// Если ключ не найден, возвращает значение по умолчанию.
//
// Параметры:
//  Коллекция - Структура, Соответствие
//  Ключ - Строка
//  ЗначениеПоУмолчанию - Произвольный
//
// Возвращаемое значение:
//  Произвольный
//
Функция ЗначениеСвойства(Коллекция, Ключ, ЗначениеПоУмолчанию = Неопределено)
	
	Если НЕ Коллекции.ЭтоКоллекцияКлючЗначение(Коллекция) Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Для Каждого ЭлементКоллекции Из Коллекция Цикл
		Если НРег(ЭлементКоллекции.Ключ) = НРег(Ключ) Тогда
			Возврат ЭлементКоллекции.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЗначениеПоУмолчанию;
	
КонецФункции

// Инициализирует контектс обработчика HTTP-сервис запроса.
//
// Параметры:
//  ВходящийКонтекст - Структура
//
Процедура Инициализировать(ВходящийКонтекст) Экспорт
	
	Контекст = ВходящийКонтекст;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
