#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриДобавленииОбработчиковЗапросов(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.HTTPСервис = Справочники.HTTPСервисы.Echo;
	Обработчик.Обработчик = "ОбработчикиHTTPСервисЗапросов.ОбработатьЗапросEcho"; 
	
	Обработчик = Обработчики.Добавить();
	Обработчик.HTTPСервис = Справочники.HTTPСервисы.GetContragents;
	Обработчик.Обработчик = "ОбработчикиHTTPСервисЗапросов.ОбработатьЗапросGetContragents";
	Обработчик.ВПривилегированномРежиме = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.HTTPСервис = Справочники.HTTPСервисы.CreateContragent;
	Обработчик.Обработчик = "ОбработчикиHTTPСервисЗапросов.ОбработатьЗапросCreateContragent";
	Обработчик.ВПривилегированномРежиме = Истина;

	Обработчик = Обработчики.Добавить();
	Обработчик.HTTPСервис = Справочники.HTTPСервисы.GetContracts;
	Обработчик.Обработчик = "ОбработчикиHTTPСервисЗапросов.ОбработатьЗапросGetContracts";
	Обработчик.ВПривилегированномРежиме = Истина;
	
КонецПроцедуры

Процедура ПриДобавленииОбработчиковПроверкиЗапросов(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.HTTPСервис = Справочники.HTTPСервисы.GetContracts;
	Обработчик.Обработчик = "ОбработчикиHTTPСервисЗапросов.ПроверитьЗапросGetContracts";
	Обработчик.ВПривилегированномРежиме = Истина;
	
КонецПроцедуры

Процедура ПриДобавленииОбработчиковПроверкиОтветов(Обработчики) Экспорт
	
КонецПроцедуры

Процедура ПриДобавленииОбработчиковПроверкиПравДоступа(Обработчики) Экспорт
	
КонецПроцедуры

Процедура ОбработатьЗапросEcho(ОбработчикЗапроса, ОбработчикОтвета) Экспорт
	
	ТелоЗапроса = ОбработчикЗапроса.ТелоКакОбъект();
	ТелоОтвета = Новый Структура("response", ТелоЗапроса["request"]);
	ОбработчикОтвета.УстановитьТелоИзОбъекта(ТелоОтвета, Истина);
	
КонецПроцедуры

Процедура ОбработатьЗапросGetContragents(ОбработчикЗапроса, ОбработчикОтвета) Экспорт
	
	АктивныеКонтрагенты = Справочники.Example_Контрагенты.АктивныеКонтрагенты();
	ТелоОтвета = ТелоОтветаGetContragents(АктивныеКонтрагенты);
	ОбработчикОтвета.УстановитьТелоИзОбъекта(ТелоОтвета, Истина);
	
КонецПроцедуры

Процедура ОбработатьЗапросGetContracts(ОбработчикЗапроса, ОбработчикОтвета) Экспорт
	
	ИНН = ОбработчикЗапроса.ПараметрURL("inn");
	Договоры = Справочники.Example_Договоры.ДоговорыКонтрагента(ИНН);
	ТелоОтвета = ТелоОтветаGetContracts(Договоры);
	ОбработчикОтвета.УстановитьТелоИзОбъекта(ТелоОтвета, Истина);
	
КонецПроцедуры

Процедура ОбработатьЗапросCreateContragent(ОбработчикЗапроса, ОбработчикОтвета) Экспорт
	
	ТелоЗапроса = ОбработчикЗапроса.ТелоКакОбъект();
	
	ОписаниеДляЗаписи = Новый Структура;
	ОписаниеДляЗаписи.Вставить("Наименование", ТелоЗапроса["name"]);
	ОписаниеДляЗаписи.Вставить("ИНН", ТелоЗапроса["inn"]);
	ОписаниеДляЗаписи.Вставить("КПП", ТелоЗапроса["kpp"]);
	
	Справочники.Example_Контрагенты.СоздатьКонтрагента(ОписаниеДляЗаписи);
	
	ТелоОтвета = ТелоОтветаCreateContragent(ТелоЗапроса);
	ОбработчикОтвета.УстановитьТелоИзОбъекта(ТелоОтвета, Истина);
	
КонецПроцедуры

Процедура ПроверитьЗапросGetContracts(ОбработчикЗапроса, ОбработчикОтвета) Экспорт
	
	ИНН = ОбработчикЗапроса.ПараметрURL("inn");
	
	Если Не ЗначениеЗаполнено(ИНН) Тогда
		ОбработчикОтвета.ДобавитьОшибкуКлиента(НСтр("ru = 'Не указан ИНН контрагента.'"));
		Возврат;
	КонецЕсли;
	
	Контрагент = Справочники.Example_Контрагенты.НайтиПоРеквизиту("ИНН", ИНН);
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		ОписаниеОшибки = СтрШаблон(НСтр("ru = 'Контрагент с ИНН <%1> не найден.'"), ИНН);
		ОбработчикОтвета.ДобавитьОшибкуКлиента(ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТелоОтветаGetContragents(ДанныеКонтрагентов)
	
	ТелоОтвета = Новый Массив;
	
	Для Каждого ДанныеКонтрагента Из ДанныеКонтрагентов Цикл
		ОписаниеКонтрагента = ОписаниеКонтрагента();
		ОписаниеКонтрагента["name"] = ДанныеКонтрагента.Наименование;
		ОписаниеКонтрагента["inn"] = ДанныеКонтрагента.ИНН;
		ОписаниеКонтрагента["kpp"] = ДанныеКонтрагента.КПП;
		ТелоОтвета.Добавить(ОписаниеКонтрагента);
	КонецЦикла;
	
	Возврат ТелоОтвета;
	
КонецФункции

Функция ТелоОтветаCreateContragent(ТелоЗапроса)
	
	ТелоОтвета = ОписаниеКонтрагента();
	ТелоОтвета["name"] = ТелоЗапроса["name"];
	ТелоОтвета["inn"] = ТелоЗапроса["inn"];
	ТелоОтвета["kpp"] = ТелоЗапроса["kpp"];
	Возврат ТелоОтвета;
	
КонецФункции

Функция ТелоОтветаGetContracts(Договоры)
	
	ТелоОтвета = Новый Массив;
	
	Для Каждого Договор Из Договоры Цикл
		ОписаниеДоговора = Новый Структура;
		ОписаниеДоговора.Вставить("id", XMLСтрока(Договор.Ссылка));
		ОписаниеДоговора.Вставить("name", Договор.Наименование);
		ОписаниеДоговора.Вставить("number", Договор.Номер);
		ОписаниеДоговора.Вставить("date", Формат(Договор.Дата, "ДФ=yyyy-MM-dd"));
		ТелоОтвета.Добавить(ОписаниеДоговора);
	КонецЦикла;
	
	Возврат ТелоОтвета;
	
КонецФункции

Функция ОписаниеКонтрагента()
	
	ОписаниеКонтрагента = Новый Структура;
	ОписаниеКонтрагента.Вставить("name", "");
	ОписаниеКонтрагента.Вставить("inn", "");
	ОписаниеКонтрагента.Вставить("kpp", "");
	
	Возврат ОписаниеКонтрагента;
	
КонецФункции

#КонецОбласти

#КонецЕсли