
#Область СлужебныйПрограммныйИнтерфейс

#Область ВерсииСтандартов

// Это версия стандарта OpenAPI 3.0.3.
//
// Параметры:
//  ВерсияСтандарта - Строка - Версия стандарта OpenAPI
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоВерсияСтандарта_3_0_3(ВерсияСтандарта) Экспорт
	
	Возврат ВерсияСтандарта = "3.0.3";
	
КонецФункции

// Это версия стандарта OpenAPI 3.0.4.
//
// Параметры:
//  ВерсияСтандарта - Строка - Версия стандарта OpenAPI
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоВерсияСтандарта_3_0_4(ВерсияСтандарта) Экспорт
	
	Возврат ВерсияСтандарта = "3.0.4";
	
КонецФункции

#КонецОбласти

#Область ИсточникиПараметров

// Это источник параметров URL (path).
//
// Параметры:
//  ИсточникПараметров - Строка - Тип параметров в формате OpenAPI
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоИсточникПараметровURL(ИсточникПараметров) Экспорт
	
	Возврат НРег(ИсточникПараметров) = "path";
	
КонецФункции

// Это источник параметров Заголовок (header).
//
// Параметры:
//  ИсточникПараметров - Строка - Тип параметров в формате OpenAPI
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоИсточникПараметровЗаголовок(ИсточникПараметров) Экспорт
	
	Возврат НРег(ИсточникПараметров) = "header";
	
КонецФункции

// Это источник параметров Запрос (query).
//
// Параметры:
//  ИсточникПараметров - Строка - Тип параметров в формате OpenAPI
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоИсточникПараметровЗапрос(ИсточникПараметров) Экспорт
	
	Возврат НРег(ИсточникПараметров) = "query";
	
КонецФункции

// Это источник параметров Кука (cookie).
//
// Параметры:
//  ИсточникПараметров - Строка - Тип параметров в формате OpenAPI
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоИсточникПараметровКука(ИсточникПараметров) Экспорт
	
	Возврат НРег(ИсточникПараметров) = "cookie";
	
КонецФункции

#КонецОбласти

#Область ТипыДанных

// Возвращает тип данных в формате 1С.
//
// Параметры:
//  ТипДанных - Строка - Тип данных в формате OpenAPI
//
// Возвращаемое значение:
//  Строка - Тип данных в формате 1С
//
Функция ТипДанных(ТипДанных) Экспорт
	
	Если ЭтоТипДанныхБулево(ТипДанных) Тогда
		Результат = "Булево";
	ИначеЕсли ЭтоТипДанныхМассив(ТипДанных) Тогда
		Результат = "Массив";
	ИначеЕсли ЭтоТипДанныхОбъект(ТипДанных) Тогда
		Результат = "Объект";
	ИначеЕсли ЭтоТипДанныхСтрока(ТипДанных) Тогда
		Возврат "Строка";
	ИначеЕсли ЭтоТипДанныхЧисло(ТипДанных) Тогда
		Возврат "Число";
	Иначе
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Это тип данных Булево (boolean).
//
// Параметры:
//  ТипДанных - Строка - Тип данных в формате OpenAPI или 1С
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоТипДанныхБулево(ТипДанных) Экспорт
	
	Возврат НРег(ТипДанных) = "boolean"
		ИЛИ НРег(ТипДанных) = "булево";
	
КонецФункции

// Это тип данных Массив (array).
//
// Параметры:
//  ТипДанных - Строка - Тип данных в формате OpenAPI или 1С
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоТипДанныхМассив(ТипДанных) Экспорт
	
	Возврат НРег(ТипДанных) = "array"
		ИЛИ НРег(ТипДанных) = "массив";
	
КонецФункции

// Это тип данных Объект (object).
//
// Параметры:
//  ТипДанных - Строка - Тип данных в формате OpenAPI или 1С
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоТипДанныхОбъект(ТипДанных) Экспорт
	
	Возврат НРег(ТипДанных) = "object"
		ИЛИ НРег(ТипДанных) = "объект";
	
КонецФункции

// Это тип данных Строка (string).
//
// Параметры:
//  ТипДанных - Строка - Тип данных в формате OpenAPI или 1С
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоТипДанныхСтрока(ТипДанных) Экспорт
	
	Возврат НРег(ТипДанных) = "string"
		ИЛИ НРег(ТипДанных) = "строка";
	
КонецФункции

// Это тип данных Число (integer, number).
//
// Параметры:
//  ТипДанных - Строка - Тип данных в формате OpenAPI или 1С
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоТипДанныхЧисло(ТипДанных) Экспорт
	
	Возврат НРег(ТипДанных) = "integer"
		ИЛИ НРег(ТипДанных) = "number"
		ИЛИ НРег(ТипДанных) = "число";
	
КонецФункции

#КонецОбласти

#Область ТипыКонтента

// Возвращает тип контента в формате 1С.
//
// Параметры:
//  Тип - Строка - Тип контента в формате MIME
//
// Возвращаемое значение:
//  Строка - Тип контента в формате 1С
//
Функция ТипКонтента(Тип) Экспорт
	
	ТипыКонтента = ТипыКонтента();
	ТипНРег = НРег(Тип);
	
	Если ТипНРег = "" Тогда
		Результат = ТипыКонтента.НетКонтента;
	ИначеЕсли СтрНайти(ТипНРег, ТипыКонтента.JSON) > 0 Тогда
		Результат = ТипыКонтента.JSON;
	ИначеЕсли СтрНайти(ТипНРег, ТипыКонтента.Строка) > 0 Тогда
		Результат = ТипыКонтента.Строка;
	ИначеЕсли СтрНайти(ТипНРег, ТипыКонтента.ДвоичныеДанные) > 0 Тогда
		Результат = ТипыКонтента.ДвоичныеДанные;
	ИначеЕсли СтрНайти(ТипНРег, ТипыКонтента.PDF) > 0 Тогда
		Результат = ТипыКонтента.PDF;
	ИначеЕсли СтрНайти(ТипНРег, ТипыКонтента.DOC) > 0 Тогда
		Результат = ТипыКонтента.DOC;
	ИначеЕсли СтрНайти(ТипНРег, ТипыКонтента.XLS) > 0 Тогда
		Результат = ТипыКонтента.XLS;
	ИначеЕсли СтрНайти(ТипНРег, ТипыКонтента.PPT) > 0 Тогда
		Результат = ТипыКонтента.PPT;
	ИначеЕсли СтрНайти(ТипНРег, ТипыКонтента.DOCX) > 0 Тогда
		Результат = ТипыКонтента.DOCX;
	ИначеЕсли СтрНайти(ТипНРег, ТипыКонтента.XLSX) > 0 Тогда
		Результат = ТипыКонтента.XLSX;
	ИначеЕсли СтрНайти(ТипНРег, ТипыКонтента.PPTX) > 0 Тогда
		Результат = ТипыКонтента.PPTX;
	ИначеЕсли СтрНайти(ТипНРег, ТипыКонтента.BMP) > 0 Тогда
		Результат = ТипыКонтента.BMP;
	ИначеЕсли СтрНайти(ТипНРег, ТипыКонтента.GIF) > 0 Тогда
		Результат = ТипыКонтента.GIF;
	ИначеЕсли СтрНайти(ТипНРег, ТипыКонтента.HEIC) > 0 Тогда
		Результат = ТипыКонтента.HEIC;
	ИначеЕсли СтрНайти(ТипНРег, ТипыКонтента.JPEG) > 0 Тогда
		Результат = ТипыКонтента.JPEG;
	ИначеЕсли СтрНайти(ТипНРег, ТипыКонтента.PNG) > 0 Тогда
		Результат = ТипыКонтента.PNG;
	ИначеЕсли СтрНайти(ТипНРег, ТипыКонтента.SWG) > 0 Тогда
		Результат = ТипыКонтента.SWG;
	ИначеЕсли СтрНайти(ТипНРег, ТипыКонтента.WEBP) > 0 Тогда
		Результат = ТипыКонтента.WEBP;
	ИначеЕсли СтрНайти(ТипНРег, ТипыКонтента.HTML) > 0 Тогда
		Результат = ТипыКонтента.HTML;
	Иначе
		Результат = ТипыКонтента.Неизвестный;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает доступные типы контента.
//
// Возвращаемое значение:
//  Структура - Типы контента
//    * Ключ - Строка - Тип контента в формате 1С
//    * Значение - Строка - Тип контента в формате MIME
//
Функция ТипыКонтента() Экспорт
	
	ТипыКонтента = Новый Структура;
	ТипыКонтента.Вставить("BMP", "image/bmp");
	ТипыКонтента.Вставить("DOC", "application/msword");
	ТипыКонтента.Вставить("DOCX", "application/vnd.openxmlformats-officedocument.wordprocessingml.document");
	ТипыКонтента.Вставить("GIF", "image/gif");
	ТипыКонтента.Вставить("HEIC", "image/heic");
	ТипыКонтента.Вставить("HTML", "text/html");
	ТипыКонтента.Вставить("JPEG", "image/jpeg");
	ТипыКонтента.Вставить("JSON", "application/json");
	ТипыКонтента.Вставить("PDF", "application/pdf");
	ТипыКонтента.Вставить("PNG", "image/png");
	ТипыКонтента.Вставить("PPT", "application/vnd.ms-powerpoint");
	ТипыКонтента.Вставить("PPTX", "application/vnd.openxmlformats-officedocument.presentationml.presentation");
	ТипыКонтента.Вставить("SWG", "image/svg+xml");
	ТипыКонтента.Вставить("WEBP", "image/webp");
	ТипыКонтента.Вставить("XLS", "application/vnd.ms-excel");
	ТипыКонтента.Вставить("XLSX", "application/vnd.openxmlformats-officedocument.spreadsheetml.sheet");
	ТипыКонтента.Вставить("ДвоичныеДанные", "application/octet-stream");
	ТипыКонтента.Вставить("Неизвестный", "unknown content type");
	ТипыКонтента.Вставить("НетКонтента", "no content");
	ТипыКонтента.Вставить("Строка", "text/plain");
	Возврат ТипыКонтента;
	
КонецФункции

// Это тип контента JSON.
//
// Параметры:
//  ТипКонтента - Строка - Тип контента в формате MIME
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоТипКонтентаJSON(ТипКонтента) Экспорт
	
	Возврат ТипКонтента = ТипыКонтента().JSON;
	
КонецФункции

// Это тип контента ДвоичныеДанные.
//
// Параметры:
//  ТипКонтента - Строка - Тип контента в формате MIME
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоТипКонтентаДвоичныеДанные(ТипКонтента) Экспорт
	
	ТипыКонтента = ТипыКонтента();
	Возврат ТипКонтента = ТипыКонтента.ДвоичныеДанные
		ИЛИ ТипКонтента = ТипыКонтента.PDF
		ИЛИ ТипКонтента = ТипыКонтента.DOC
		ИЛИ ТипКонтента = ТипыКонтента.XLS
		ИЛИ ТипКонтента = ТипыКонтента.PPT
		ИЛИ ТипКонтента = ТипыКонтента.DOCX
		ИЛИ ТипКонтента = ТипыКонтента.XLSX
		ИЛИ ТипКонтента = ТипыКонтента.PPTX
		ИЛИ ТипКонтента = ТипыКонтента.BMP
		ИЛИ ТипКонтента = ТипыКонтента.GIF
		ИЛИ ТипКонтента = ТипыКонтента.HEIC
		ИЛИ ТипКонтента = ТипыКонтента.JPEG
		ИЛИ ТипКонтента = ТипыКонтента.PNG
		ИЛИ ТипКонтента = ТипыКонтента.SWG
		ИЛИ ТипКонтента = ТипыКонтента.WEBP;
	
КонецФункции

// Это тип контента НетКонтента.
//
// Параметры:
//  ТипКонтента - Строка - Тип контента в формате MIME
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоТипКонтентаНетКонтента(ТипКонтента) Экспорт
	
	Возврат ТипКонтента = ТипыКонтента().НетКонтента;
	
КонецФункции

// Это тип контента Строка.
//
// Параметры:
//  ТипКонтента - Строка - Тип контента в формате MIME
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоТипКонтентаСтрока(ТипКонтента) Экспорт
	
	ТипыКонтента = ТипыКонтента();
	Возврат ТипКонтента = ТипыКонтента.Строка
		ИЛИ ТипКонтента = ТипыКонтента.HTML;
	
КонецФункции

#КонецОбласти

#Область ФорматыДанных

// Возвращает формат данных в формате 1С.
//
// Параметры:
//  ФорматДанных - Строка - Формат данных в формате OpenAPI
//
// Возвращаемое значение:
//  Строка - Формат данных в формате 1С
//
Функция ФорматДанных(ФорматДанных) Экспорт
	
	Если ЭтоФорматДанныхАдресЭлектроннойПочты(ФорматДанных) Тогда
		Результат = "АдресЭлектроннойПочты";
	ИначеЕсли ЭтоФорматДанныхБайты(ФорматДанных) Тогда
		Результат = "Байты";
	ИначеЕсли ЭтоФорматДанныхБольшоеДробноеЧисло(ФорматДанных) Тогда
		Результат = "БольшоеДробноеЧисло";
	ИначеЕсли ЭтоФорматДанныхБольшоеЦелоеЧисло(ФорматДанных) Тогда
		Результат = "БольшоеЦелоеЧисло";
	ИначеЕсли ЭтоФорматДанныхДата(ФорматДанных) Тогда
		Результат = "Дата";
	ИначеЕсли ЭтоФорматДанныхДатаВремя(ФорматДанных) Тогда
		Результат = "ДатаВремя";
	ИначеЕсли ЭтоФорматДанныхДвоичныеДанные(ФорматДанных) Тогда
		Результат = "ДвоичныеДанные";
	ИначеЕсли ЭтоФорматДанныхДробноеЧисло(ФорматДанных) Тогда
		Результат = "ДробноеЧисло";
	ИначеЕсли ЭтоФорматДанныхПароль(ФорматДанных) Тогда
		Результат = "Пароль"; // BSLLS:UsingHardcodeSecretInformation-off
	ИначеЕсли ЭтоФорматДанныхТокен(ФорматДанных) Тогда
		Результат = "Токен"; // BSLLS:UsingHardcodeSecretInformation-off
	ИначеЕсли ЭтоФорматДанныхУникальныйИдентификатор(ФорматДанных) Тогда
		Результат = "УникальныйИдентификатор";
	ИначеЕсли ЭтоФорматДанныхЦелоеЧисло(ФорматДанных) Тогда
		Результат = "ЦелоеЧисло";
	Иначе
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Это формат данных АдресЭлектроннойПочты (email).
//
// Параметры:
//  ФорматДанных - Строка - Формат данных в формате OpenAPI
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоФорматДанныхАдресЭлектроннойПочты(ФорматДанных) Экспорт
	
	Возврат НРег(ФорматДанных) = "email"
		ИЛИ НРег(ФорматДанных) = "адресэлектроннойпочты";
	
КонецФункции

// Это формат данных Байты (byte).
//
// Параметры:
//  ФорматДанных - Строка - Формат данных в формате OpenAPI
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоФорматДанныхБайты(ФорматДанных) Экспорт
	
	Возврат НРег(ФорматДанных) = "byte"
		ИЛИ НРег(ФорматДанных) = "байты";
	
КонецФункции

// Это формат данных БольшоеДробноеЧисло (double).
//
// Параметры:
//  ФорматДанных - Строка - Формат данных в формате OpenAPI
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоФорматДанныхБольшоеДробноеЧисло(ФорматДанных) Экспорт
	
	Возврат НРег(ФорматДанных) = "double"
		ИЛИ НРег(ФорматДанных) = "большоедробноечисло";
	
КонецФункции

// Это формат данных БольшоеЦелоеЧисло (int64).
//
// Параметры:
//  ФорматДанных - Строка - Формат данных в формате OpenAPI
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоФорматДанныхБольшоеЦелоеЧисло(ФорматДанных) Экспорт
	
	Возврат НРег(ФорматДанных) = "int64"
		ИЛИ НРег(ФорматДанных) = "большоецелоечисло";
	
КонецФункции

// Это формат данных Дата (date).
//
// Параметры:
//  ФорматДанных - Строка - Формат данных в формате OpenAPI
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоФорматДанныхДата(ФорматДанных) Экспорт
	
	Возврат НРег(ФорматДанных) = "date"
		ИЛИ НРег(ФорматДанных) = "дата";
	
КонецФункции

// Это формат данных ДатаВремя (date-time).
//
// Параметры:
//  ФорматДанных - Строка - Формат данных в формате OpenAPI
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоФорматДанныхДатаВремя(ФорматДанных) Экспорт
	
	Возврат НРег(ФорматДанных) = "date-time"
		ИЛИ НРег(ФорматДанных) = "датавремя";
	
КонецФункции

// Это формат данных ДвоичныеДанные (binary).
//
// Параметры:
//  ФорматДанных - Строка - Формат данных в формате OpenAPI
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоФорматДанныхДвоичныеДанные(ФорматДанных) Экспорт
	
	Возврат НРег(ФорматДанных) = "binary"
		ИЛИ НРег(ФорматДанных) = "двоичныеданные";
	
КонецФункции

// Это формат данных ДробноеЧисло (float).
//
// Параметры:
//  ФорматДанных - Строка - Формат данных в формате OpenAPI
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоФорматДанныхДробноеЧисло(ФорматДанных) Экспорт
	
	Возврат НРег(ФорматДанных) = "float"
		ИЛИ НРег(ФорматДанных) = "дробноечисло";
	
КонецФункции

// Это формат данных Пароль (password).
//
// Параметры:
//  ФорматДанных - Строка - Формат данных в формате OpenAPI
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоФорматДанныхПароль(ФорматДанных) Экспорт
	
	Возврат НРег(ФорматДанных) = "password" // BSLLS:UsingHardcodeSecretInformation-off
		ИЛИ НРег(ФорматДанных) = "пароль"; // BSLLS:UsingHardcodeSecretInformation-off
	
КонецФункции

// Это формат данных Токен (token).
//
// Параметры:
//  ФорматДанных - Строка - Формат данных в формате OpenAPI
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоФорматДанныхТокен(ФорматДанных) Экспорт
	
	Возврат НРег(ФорматДанных) = "token" // BSLLS:UsingHardcodeSecretInformation-off
		ИЛИ НРег(ФорматДанных) = "токен"; // BSLLS:UsingHardcodeSecretInformation-off
	
КонецФункции

// Это формат данных УникальныйИдентификатор (uuid).
//
// Параметры:
//  ФорматДанных - Строка - Формат данных в формате OpenAPI
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоФорматданныхУникальныйИдентификатор(ФорматДанных) Экспорт
	
	Возврат НРег(ФорматДанных) = "uuid"
		ИЛИ НРег(ФорматДанных) = "уникальныйидентификатор";
	
КонецФункции

// Это формат данных ЦелоеЧисло (binary).
//
// Параметры:
//  ФорматДанных - Строка - Формат данных в формате OpenAPI
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоФорматДанныхЦелоеЧисло(ФорматДанных) Экспорт
	
	Возврат НРег(ФорматДанных) = "int32"
		ИЛИ НРег(ФорматДанных) = "целоечисло";
	
КонецФункции

#КонецОбласти

#КонецОбласти
