
#Область СлужебныйПрограммныйИнтерфейс

// Читает схему OpenAPI в формате JSON и сериализует ее в формат 1С.
// В случае ошибки выбрасывает исключение.
//
// Параметры:
//  СхемаJSON - Строка
//
// Возвращаемое значение:
//  Соответствие
//
Функция ПрочитатьСхемуJSON(СхемаJSON) Экспорт
	
	Схема = ПрочитатьДанныеJSON(СхемаJSON);
	Возврат СериализоватьСхемуOpenAPI(Схема);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеСхемы

// Заполняет схему HTTP-сервиса.
//
// Параметры:
//  ВерсияСтандарта - Строка
//  Схема - Соответствие
//  Компоненты - Соответствие, Неопределено
//  HTTPСервис - Структура
//  Метод - Строка
//  ШаблонURL - Строка
//
Процедура ЗаполнитьHTTPСервис(ВерсияСтандарта, Схема, Компоненты, HTTPСервис, Метод, ШаблонURL)
	
	HTTPСервис.ВерсияСтандарта = ВерсияСтандарта;
	HTTPСервис.ШаблонURL = ШаблонURL;
	HTTPСервис.Идентификатор = ЗначениеСвойстваСхемы(Схема, Неопределено, "operationId", "");
	HTTPСервис.Метод = ВРег(Метод);
	HTTPСервис.Устарел = ЗначениеСвойстваСхемы(Схема, Неопределено, "deprecated", Ложь);
	
	Ответы = ЗначениеСвойстваСхемы(Схема, Неопределено, "responses");
	ЗаполнитьОтветы(Ответы, Компоненты, HTTPСервис);
	
	Параметры = ЗначениеСвойстваСхемы(Схема, Неопределено, "parameters");
	ЗаполнитьПараметры(Параметры, Компоненты, HTTPСервис);
	
	ТелоЗапроса = ЗначениеСвойстваСхемы(Схема, Компоненты, "requestBody");
	ЗаполнитьТелоЗапроса(ТелоЗапроса, Компоненты, HTTPСервис);
	
КонецПроцедуры

// Заполняет доступные значения у произвольного объекта.
//
// Параметры:
//  Схемы - Массив из Соответствие, Неопределено
//  Компоненты - Структура, Неопределено
//  Владелец - Структура
//
Процедура ЗаполнитьДоступныеЗначения(Схемы, Компоненты, Владелец)
	
	Если Схемы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Схема Из Схемы Цикл
		Если Коллекции.ЭтоСоответствие(Схема) Тогда
			ДоступноеЗначение = ПрочитатьДоступноеЗначение(Схема, Компоненты);
		Иначе
			ДоступноеЗначение = Схема;
		КонецЕсли;
		
		Если Владелец.ДоступныеЗначения = Неопределено Тогда
			Владелец.ДоступныеЗначения = Новый Массив;
		КонецЕсли;
		
		Владелец.ДоступныеЗначения.Добавить(ДоступноеЗначение);
	КонецЦикла;
	
КонецПроцедуры

// Заполняет схему заголовков ответа.
//
// Параметры:
//  Схема - Соответствие, Неопределено
//  Компоненты - Соответствие, Неопределено
//  Ответ - Структура
//
Процедура ЗаполнитьЗаголовкиОтвета(Схема, Компоненты, Ответ)
	
	Если Схема = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементСхемы Из Схема Цикл
		Заголовок = ПрочитатьЗаголовокОтвета(ЭлементСхемы.Значение, Компоненты, ЭлементСхемы.Ключ);
		ДоступныеЗначения = ЗначениеСвойстваСхемы(ЭлементСхемы.Значение, Компоненты, "enum");
		ЗаполнитьДоступныеЗначения(ДоступныеЗначения, Компоненты, Заголовок);
		Ответ.Заголовки.Добавить(Заголовок);
	КонецЦикла;
	
КонецПроцедуры

// Заполняет схему контента ответа.
//
// Параметры:
//  Схема - Соответствие
//  Компоненты - Соответствие, Неопределено
//  Ответ - Структура
//
Процедура ЗаполнитьКонтентОтвета(Схема, Компоненты, Ответ)
	
	ВложеннаяСхема = ЗначениеСвойстваСхемы(Схема.Значение, Компоненты, "schema");
	Ответ.Тип = НРег(Схема.Ключ);
	Ответ.Контент = ПрочитатьКонтентОтвета(ВложеннаяСхема, Компоненты);
	
КонецПроцедуры

// Заполняет контент тела запроса.
//
// Параметры:
//  Схема - Соответствие
//  Компоненты - Соответствие, Неопределено
//  ТелоЗапроса - Структура
//  Обязательный - Булево
//
Процедура ЗаполнитьКонтентТелаЗапроса(Схема, Компоненты, ТелоЗапроса, Обязательный)
	
	ВложеннаяСхема = ЗначениеСвойстваСхемы(Схема.Значение, Компоненты, "schema");
	ТелоЗапроса.Обязательный = Обязательный;
	ТелоЗапроса.Тип = НРег(Схема.Ключ);
	ТелоЗапроса.Контент = ПрочитатьКонтентТелаЗапроса(ВложеннаяСхема, Компоненты);
	
КонецПроцедуры

// Заполняет схему ответов.
//
// Параметры:
//  Схема - Соответствие, Неопределено
//  Компоненты - Соответствие, Неопределено
//  HTTPСервис - Структура
//
Процедура ЗаполнитьОтветы(Схема, Компоненты, HTTPСервис)
	
	Если Схема = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементСхемы Из Схема Цикл
		Контенты = ЗначениеСвойстваСхемы(ЭлементСхемы.Значение, Компоненты, "content");
		Заголовки = ЗначениеСвойстваСхемы(ЭлементСхемы.Значение, Компоненты, "headers");
		
		Если Контенты = Неопределено Тогда
			// TODO - Костыль
			Если НРег(ЭлементСхемы.Ключ) = "default" Тогда
				Продолжить;
			КонецЕсли;
			
			Ответ = ПрочитатьОтвет(ЭлементСхемы.Значение, Компоненты, ЭлементСхемы.Ключ);
			ЗаполнитьЗаголовкиОтвета(Заголовки, Компоненты, Ответ);
			HTTPСервис.Ответы.Добавить(Ответ);
		Иначе
			Для Каждого Контент Из Контенты Цикл
				// TODO - Костыль
				Если НРег(ЭлементСхемы.Ключ) = "default" Тогда
					Продолжить;
				КонецЕсли;
				
				Ответ = ПрочитатьОтвет(ЭлементСхемы.Значение, Компоненты, ЭлементСхемы.Ключ);
				ЗаполнитьЗаголовкиОтвета(Заголовки, Компоненты, Ответ);
				ЗаполнитьКонтентОтвета(Контент, Компоненты, Ответ);
				HTTPСервис.Ответы.Добавить(Ответ);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Заполняет схему параметра.
//
// Параметры:
//  Схема - Соответствие
//  Компоненты - Соответствие, Неопределено
//  Параметры - Массив из Структура
//
Процедура ЗаполнитьПараметр(Схема, Компоненты, Параметры)
	
	Параметр = ПрочитатьПараметр(Схема, Компоненты);
	ДоступныеЗначения = ЗначениеСвойстваСхемы(Схема, Компоненты, "enum");
	ЗаполнитьДоступныеЗначения(ДоступныеЗначения, Компоненты, Параметр);
	Параметры.Добавить(Параметр);
	
КонецПроцедуры

// Заполняет схему параметров.
//
// Параметры:
//  Схема - Соответствие, Неопределено
//  Компоненты - Соответствие, Неопределено
//  HTTPСервис - Структура
//
Процедура ЗаполнитьПараметры(Схема, Компоненты, HTTPСервис)
	
	Если Схема = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементСхемы Из Схема Цикл
		ИсточникПараметров = ЗначениеСвойстваСхемы(ЭлементСхемы, Компоненты, "in");
		
		Если СхемыHTTPСервисовПовтИсп.ЭтоИсточникПараметровURL(ИсточникПараметров) Тогда
			ЗаполнитьПараметр(ЭлементСхемы, Компоненты, HTTPСервис.ПараметрыURL);
		ИначеЕсли СхемыHTTPСервисовПовтИсп.ЭтоИсточникПараметровЗапрос(ИсточникПараметров) Тогда
			ЗаполнитьПараметр(ЭлементСхемы, Компоненты, HTTPСервис.ПараметрыЗапроса);
		ИначеЕсли СхемыHTTPСервисовПовтИсп.ЭтоИсточникПараметровЗаголовок(ИсточникПараметров) Тогда
			ЗаполнитьПараметр(ЭлементСхемы, Компоненты, HTTPСервис.ПараметрыЗаголовков);
		ИначеЕсли СхемыHTTPСервисовПовтИсп.ЭтоИсточникПараметровКука(ИсточникПараметров) Тогда
			ЗаполнитьПараметр(ЭлементСхемы, Компоненты, HTTPСервис.ПараметрыКуки);
		КонецЕсли; // BSLLS:IfElseIfEndsWithElse-off
	КонецЦикла;
	
КонецПроцедуры

// Заполняет схему тела запроса.
//
// Параметры:
//  Схема - Соответствие, Неопределено
//  Компоненты - Соответствие, Неопределено
//  HTTPСервис - Структура
//
Процедура ЗаполнитьТелоЗапроса(Схема, Компоненты, HTTPСервис)
	
	Если Схема = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Обязательный = ЗначениеСвойстваСхемы(Схема, Компоненты, "required", Ложь);
	Контенты = ЗначениеСвойстваСхемы(Схема, Компоненты, "content");
	
	Для Каждого Контент Из Контенты Цикл
		ТелоЗапроса = ПрочитатьТелоЗапроса(Схема, Компоненты);
		ЗаполнитьКонтентТелаЗапроса(Контент, Компоненты, ТелоЗапроса, Обязательный);
		HTTPСервис.ТелоЗапроса.Добавить(ТелоЗапроса);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЧтениеСхемыПоВиду

// Читает описание доступного значений.
//
// Параметры:
//  Схема - Соответствие
//  Компоненты - Соответствие, Неопределено
//
// Возвращаемое значение:
//  Структура
//
Функция ПрочитатьДоступноеЗначение(Схема, Компоненты)
	
	Возврат ПрочитатьДанныеРекурсивно(Схема, Компоненты);
	
КонецФункции

// Читает описание заголовка ответа.
//
// Параметры:
//  Схема - Соответствие
//  Компоненты - Соответствие, Неопределено
//  Имя - Строка
//
// Возвращаемое значение:
//  Структура
//
Функция ПрочитатьЗаголовокОтвета(Схема, Компоненты, Имя)
	
	Обязательный = ЗначениеСвойстваСхемы(Схема, Компоненты, "required", Ложь);
	Устарел = ЗначениеСвойстваСхемы(Схема, Компоненты, "deprecated", Ложь);
	ВложеннаяСхема = ЗначениеСвойстваСхемы(Схема, Компоненты, "schema");
	
	Заголовок = ПрочитатьДанныеРекурсивно(ВложеннаяСхема, Компоненты);
	Заголовок.Вставить("Имя", Имя);
	Заголовок.Вставить("Обязательный", Обязательный);
	Заголовок.Вставить("Устарел", Устарел);
	
	Варианты = Коллекции.ЗначениеСвойстваСтруктуры(Заголовок, "Варианты");
	
	Если Варианты <> Неопределено Тогда
		Для Каждого Вариант Из Варианты Цикл
			Вариант.Вставить("Обязательный", Обязательный);
			Вариант.Вставить("Устарел", Устарел);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Заголовок;
	
КонецФункции

// Читает описание контента тела запроса.
//
// Параметры:
//  Схема - Соответствие
//  Компоненты - Соответствие, Неопределено
//
// Возвращаемое значение:
//  Структура
//
Функция ПрочитатьКонтентТелаЗапроса(Схема, Компоненты)
	
	Возврат ПрочитатьДанныеРекурсивно(Схема, Компоненты);
	
КонецФункции

// Читает описание контента ответа.
//
// Параметры:
//  Схема - Соответствие
//  Компоненты - Соответствие, Неопределено
//
// Возвращаемое значение:
//  Структура
//
Функция ПрочитатьКонтентОтвета(Схема, Компоненты)
	
	Возврат ПрочитатьДанныеРекурсивно(Схема, Компоненты);
	
КонецФункции

// Читает описание ответа.
//
// Параметры:
//  Схема - Соответствие
//  Компоненты - Соответствие, Неопределено
//  КодСостояния - Число
//
// Возвращаемое значение:
//  Структура
//
Функция ПрочитатьОтвет(Схема, Компоненты, КодСостояния)
	
	Ответ = НовыйОтвет();
	Ответ.КодСостояния = Число(КодСостояния); // TODO - Переписать
	Возврат Ответ;
	
КонецФункции

// Читает описание параметра запроса и параметра заголовка.
//
// Параметры:
//  Схема - Соответствие
//  Компоненты - Соответствие, Неопределено
//
// Возвращаемое значение:
//  Структура
//
Функция ПрочитатьПараметр(Схема, Компоненты)
	
	Имя = ЗначениеСвойстваСхемы(Схема, Компоненты, "name");
	Обязательный = ЗначениеСвойстваСхемы(Схема, Компоненты, "required", Ложь);
	Устарел = ЗначениеСвойстваСхемы(Схема, Компоненты, "deprecated", Ложь);
	ВложеннаяСхема = ЗначениеСвойстваСхемы(Схема, Компоненты, "schema");
	
	Параметр = ПрочитатьДанныеРекурсивно(ВложеннаяСхема, Компоненты);
	Параметр.Вставить("Имя", Имя);
	Параметр.Вставить("Обязательный", Обязательный);
	Параметр.Вставить("Устарел", Устарел);
	
	Варианты = Коллекции.ЗначениеСвойстваСтруктуры(Параметр, "Варианты");
	
	Если Варианты <> Неопределено Тогда
		Для Каждого Вариант Из Варианты Цикл
			Вариант.Вставить("Обязательный", Обязательный);
			Вариант.Вставить("Устарел", Устарел);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Параметр;
	
КонецФункции

// Читает описание тела запроса.
//
// Параметры:
//  Схема - Соответствие
//  Компоненты - Соответствие, Неопределено
//
// Возвращаемое значение:
//  Структура
//
Функция ПрочитатьТелоЗапроса(Схема, Компоненты)
	
	Возврат НовыйТелоЗапроса();
	
КонецФункции

#КонецОбласти

#Область ЧтениеСхемыПоТипу

// Читает данные с типом Булево из схемы.
//
// Параметры:
//  Схема - Соответствие
//  Компоненты - Соответствие, Неопределено
//
// Возвращаемое значение:
//  Структура
//
Функция ПрочитатьБулево(Схема, Компоненты)
	
	Возврат ПрочитатьДанные(Схема, Компоненты);
	
КонецФункции

// Читает варианты данные с неопределенным типом из схемы рекурсивно.
//
// Параметры:
//  Схемы - Массив из Соответствие
//  Компоненты - Соответствие, Неопределено
//  Опциональные - Булево
//
// Возвращаемое значение:
//  Структура
//
Функция ПрочитатьВариантыДанныхРекурсивно(Схемы, Компоненты, Опциональные)
	
	Данные = НовыйВарианты();
	Данные.Опциональные = Опциональные;
	
	Для Каждого Схема Из Схемы Цикл
		ВариантДанных = ПрочитатьДанныеРекурсивно(Схема, Компоненты);
		Данные.Варианты.Добавить(ВариантДанных);
	КонецЦикла;
	
	Возврат Данные;
	
КонецФункции

// Читает данные с неопределенным типом из схемы.
//
// Параметры:
//  Схема - Соответствие
//  Компоненты - Соответствие, Неопределено
//
// Возвращаемое значение:
//  Структура
//
Функция ПрочитатьДанные(Схема, Компоненты)
	
	Данные = НовыйДанные();
	Данные.Тип = СхемыHTTPСервисовПовтИсп.ТипДанных(ЗначениеСвойстваСхемы(Схема, Компоненты, "type", ""));
	Данные.ДоступноNULL = ЗначениеСвойстваСхемы(Схема, Компоненты, "nullable", Ложь);
	Данные.Устарел = ЗначениеСвойстваСхемы(Схема, Компоненты, "deprecated", Ложь);
	
	ДоступныеЗначения = ЗначениеСвойстваСхемы(Схема, Компоненты, "enum");
	ЗаполнитьДоступныеЗначения(ДоступныеЗначения, Компоненты, Данные);
	
	Возврат Данные;
	
КонецФункции

// Читает данные с неопределенным типом из схемы рекурсивно.
//
// Параметры:
//  Схема - Соответствие
//  Компоненты - Соответствие, Неопределено
//
// Возвращаемое значение:
//  Структура
//
Функция ПрочитатьДанныеРекурсивно(Схема, Компоненты)
	
	Варианты = ЗначениеСвойстваСхемы(Схема, Компоненты, "oneOf");
	Опциональные = Ложь;
	
	Если Варианты = Неопределено Тогда
		Варианты = ЗначениеСвойстваСхемы(Схема, Компоненты, "anyOf");
		Опциональные = Истина;
	КонецЕсли;
	
	Если Варианты = Неопределено Тогда
		ТипДанных = ЗначениеСвойстваСхемы(Схема, Компоненты, "type", "");
		
		Если СхемыHTTPСервисовПовтИсп.ЭтоТипДанныхМассив(ТипДанных) Тогда
			Данные = ПрочитатьМассив(Схема, Компоненты);
		ИначеЕсли СхемыHTTPСервисовПовтИсп.ЭтоТипДанныхОбъект(ТипДанных) Тогда
			ОбязательныеПоля = ЗначениеСвойстваСхемы(Схема, Компоненты, "required");
			Данные = ПрочитатьОбъект(Схема, Компоненты, ОбязательныеПоля);
		ИначеЕсли СхемыHTTPСервисовПовтИсп.ЭтоТипДанныхСтрока(ТипДанных) Тогда
			Данные = ПрочитатьСтроку(Схема, Компоненты);
		ИначеЕсли СхемыHTTPСервисовПовтИсп.ЭтоТипДанныхЧисло(ТипДанных) Тогда
			Данные = ПрочитатьЧисло(Схема, Компоненты);
		ИначеЕсли СхемыHTTPСервисовПовтИсп.ЭтоТипДанныхБулево(ТипДанных) Тогда
			Данные = ПрочитатьБулево(Схема, Компоненты);
		Иначе
			Данные = ПрочитатьДанные(Схема, Компоненты);
		КонецЕсли;
	Иначе
		Данные = ПрочитатьВариантыДанныхРекурсивно(Варианты, Компоненты, Опциональные);
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

// Читает дополнительное свойство данных с типом Объект из схемы.
//
// Параметры:
//  Схема - Соответствие
//  Компоненты - Соответствие, Неопределено
//
// Возвращаемое значение:
//  Структура
//
Функция ПрочитатьДополнительноеСвойствоОбъекта(Схема, Компоненты)
	
	Возврат ПрочитатьДанныеРекурсивно(Схема, Компоненты);
	
КонецФункции

// Читает данные с типом Массив из схемы.
//
// Параметры:
//  Схема - Соответствие
//  Компоненты - Соответствие, Неопределено
//
// Возвращаемое значение:
//  Структура
//
Функция ПрочитатьМассив(Схема, Компоненты)
	
	МаксимальноеКоличество = ЗначениеСвойстваСхемы(Схема, Компоненты, "maxItems");
	МинимальноеКоличество = ЗначениеСвойстваСхемы(Схема, Компоненты, "minItems");
	Уникальные = ЗначениеСвойстваСхемы(Схема, Компоненты, "uniqueItems", Ложь);
	Элементы = ЗначениеСвойстваСхемы(Схема, Компоненты, "items");
	
	Данные = ПрочитатьДанные(Схема, Компоненты);
	Данные.Вставить("Элементы", Новый Массив);
	Данные.Вставить("МинимальноеКоличество", МинимальноеКоличество);
	Данные.Вставить("МаксимальноеКоличество", МаксимальноеКоличество);
	Данные.Вставить("Уникальные", Уникальные);
	ВложенныеДанные = ПрочитатьЭлементМассива(Элементы, Компоненты);
	Данные.Элементы.Добавить(ВложенныеДанные);
	Возврат Данные;
	
КонецФункции

// Читает данные с типом Объект из схемы.
//
// Параметры:
//  Схема - Соответствие
//  Компоненты - Соответствие, Неопределено
//  ОбязательныеПоля - Массив из Строка
//
// Возвращаемое значение:
//  Структура
//
Функция ПрочитатьОбъект(Схема, Компоненты, ОбязательныеПоля)
	
	МаксимальноеКоличество = ЗначениеСвойстваСхемы(Схема, Компоненты, "maxProperties");
	МинимальноеКоличество = ЗначениеСвойстваСхемы(Схема, Компоненты, "minProperties");
	Свойства = ЗначениеСвойстваСхемы(Схема, Компоненты, "properties", Новый Структура);
	ДополнительныеСвойства = ЗначениеСвойстваСхемы(Схема, Компоненты, "additionalProperties", Истина);
	
	Если Коллекции.ЭтоКоллекцияКлючЗначение(ДополнительныеСвойства) Тогда
		ДополнительныеСвойства = ПрочитатьДополнительноеСвойствоОбъекта(ДополнительныеСвойства, Компоненты);
	КонецЕсли;
	
	Данные = ПрочитатьДанные(Схема, Компоненты);
	Данные.Вставить("МинимальноеКоличество", МинимальноеКоличество);
	Данные.Вставить("МаксимальноеКоличество", МаксимальноеКоличество);
	Данные.Вставить("Свойства", Новый Массив);
	Данные.Вставить("ДополнительныеСвойства", ДополнительныеСвойства);
	
	Для Каждого Свойство Из Свойства Цикл
		ВложенныеДанные = ПрочитатьСвойствоОбъекта(Свойство.Значение, Компоненты, Свойство.Ключ, ОбязательныеПоля);
		Данные.Свойства.Добавить(ВложенныеДанные);
	КонецЦикла;
	
	Возврат Данные;
	
КонецФункции

// Читает свойство данных с типом Объект из схемы.
//
// Параметры:
//  Схема - Соответствие
//  Компоненты - Соответствие, Неопределено
//  Имя - Строка
//  ОбязательныеПоля - Массив из Строка
//
// Возвращаемое значение:
//  Структура
//
Функция ПрочитатьСвойствоОбъекта(Схема, Компоненты, Имя, ОбязательныеПоля)
	
	Если Коллекции.ЭтоМассив(ОбязательныеПоля) Тогда
		Обязательный = ОбязательныеПоля.Найти(Имя) <> Неопределено;
	Иначе
		Обязательный = Ложь;
	КонецЕсли;
	
	Данные = ПрочитатьДанныеРекурсивно(Схема, Компоненты);
	Данные.Вставить("Имя", Имя);
	Данные.Вставить("Обязательный", Обязательный);
	
	Варианты = Коллекции.ЗначениеСвойстваСтруктуры(Данные, "Варианты");
	
	Если Варианты <> Неопределено Тогда
		Для Каждого Вариант Из Варианты Цикл
			Вариант.Вставить("Обязательный", Обязательный);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

// Читает данные с типом Строка из схемы.
//
// Параметры:
//  Схема - Соответствие
//  Компоненты - Соответствие, Неопределено
//
// Возвращаемое значение:
//  Структура
//
Функция ПрочитатьСтроку(Схема, Компоненты)
	
	ФорматДанных = СхемыHTTPСервисовПовтИсп.ФорматДанных(ЗначениеСвойстваСхемы(Схема, Компоненты, "format", ""));
	Паттерн = ЗначениеСвойстваСхемы(Схема, Компоненты, "pattern");
	МинимальнаяДлинна = ЗначениеСвойстваСхемы(Схема, Компоненты, "minLength");
	МаксимальнаяДлинна = ЗначениеСвойстваСхемы(Схема, Компоненты, "maxLength");
	
	Данные = ПрочитатьДанные(Схема, Компоненты);
	Данные.Вставить("Формат", ФорматДанных);
	Данные.Вставить("Паттерн", Паттерн);
	Данные.Вставить("МинимальнаяДлинна", МинимальнаяДлинна);
	Данные.Вставить("МаксимальнаяДлинна", МаксимальнаяДлинна);
	Возврат Данные;
	
КонецФункции

// Читает данные с типом Число из схемы.
//
// Параметры:
//  Схема - Соответствие
//  Компоненты - Соответствие, Неопределено
//
// Возвращаемое значение:
//  Структура
//
Функция ПрочитатьЧисло(Схема, Компоненты)
	
	ФорматДанных = СхемыHTTPСервисовПовтИсп.ФорматДанных(ЗначениеСвойстваСхемы(Схема, Компоненты, "format", ""));
	МинимальноеЗначение = ЗначениеСвойстваСхемы(Схема, Компоненты, "minimum");
	МаксимальноеЗначение = ЗначениеСвойстваСхемы(Схема, Компоненты, "maximum");
	ЗначениеКратно = ЗначениеСвойстваСхемы(Схема, Компоненты, "multipleOf");
	ИсключитьМинимальноеЗначение = ЗначениеСвойстваСхемы(Схема, Компоненты, "exclusiveMinimum", Ложь);
	ИсключитьМаксимальноеЗначение = ЗначениеСвойстваСхемы(Схема, Компоненты, "exclusiveMaximum", Ложь);
	
	Данные = ПрочитатьДанные(Схема, Компоненты);
	Данные.Вставить("Формат", ФорматДанных);
	Данные.Вставить("МинимальноеЗначение", МинимальноеЗначение);
	Данные.Вставить("МаксимальноеЗначение", МаксимальноеЗначение);
	Данные.Вставить("ИсключитьМинимальноеЗначение", ИсключитьМинимальноеЗначение);
	Данные.Вставить("ИсключитьМаксимальноеЗначение", ИсключитьМаксимальноеЗначение);
	Данные.Вставить("ЗначениеКратно", ЗначениеКратно);
	Возврат Данные;
	
КонецФункции

// Читает элемент данных с типом массив из схемы.
//
// Параметры:
//  Схема - Соответствие
//  Компоненты - Соответствие, Неопределено
//
// Возвращаемое значение:
//  Структура
//
Функция ПрочитатьЭлементМассива(Схема, Компоненты)
	
	Возврат ПрочитатьДанныеРекурсивно(Схема, Компоненты);
	
КонецФункции

#КонецОбласти

#Область Конструкторы

// Конструктор нового описания HTTP-сервиса.
//
// Возвращаемое значение:
//  Структура:
//    * ВерсияСтандарта - Строка
//    * Идентификатор - Строка
//    * Метод - Строка
//    * Ответы - Массив из Структура
//    * ПараметрыURL - Массив из Структура
//    * ПараметрыЗаголовков - Массив из Структура
//    * ПараметрыЗапроса - Массив из Структура
//    * ПараметрыКуки - Массив из Структура
//    * ТелоЗапроса - Массив из Структура
//    * Устарел - Булево
//    * ШаблонURL - Строка
//
Функция НовыйHTTPСервис()
	
	HTTPСервис = Новый Структура;
	HTTPСервис.Вставить("ВерсияСтандарта", "");
	HTTPСервис.Вставить("Идентификатор", "");
	HTTPСервис.Вставить("Метод", "");
	HTTPСервис.Вставить("Ответы", Новый Массив);
	HTTPСервис.Вставить("ПараметрыURL", Новый Массив);
	HTTPСервис.Вставить("ПараметрыЗаголовков", Новый Массив);
	HTTPСервис.Вставить("ПараметрыЗапроса", Новый Массив);
	HTTPСервис.Вставить("ПараметрыКуки", Новый Массив);
	HTTPСервис.Вставить("ТелоЗапроса", Новый Массив);
	HTTPСервис.Вставить("Устарел", Ложь);
	HTTPСервис.Вставить("ШаблонURL", "");
	Возврат HTTPСервис;
	
КонецФункции

// Конструктор нового описания вариантов данных.
//
// Возвращаемое значение:
//  Структура:
//    * Варианты - Массив из Структура
//    * Опциональные - Булево
//
Функция НовыйВарианты()
	
	Варианты = Новый Структура;
	Варианты.Вставить("Варианты", Новый Массив);
	Варианты.Вставить("Опциональные", Ложь);
	Возврат Варианты;
	
КонецФункции

// Конструктор нового описания даннных.
//
// Возвращаемое значение:
//  Структура:
//    * ДоступноNULL - Булево
//    * ДоступныеЗначения - Массив из Структура, Неопределено
//    * Тип - Строка
//    * Устарел - Булево
//
Функция НовыйДанные()
	
	Данные = Новый Структура;
	Данные.Вставить("ДоступноNULL", Ложь);
	Данные.Вставить("ДоступныеЗначения");
	Данные.Вставить("Тип", "");
	Данные.Вставить("Устарел", Ложь);
	Возврат Данные;
	
КонецФункции

// Конструктор нового описания заголовка.
//
// Возвращаемое значение:
//  Структура:
//    * Заголовки - Массив из Структура
//    * КодСостояния - Число
//    * Контент - Структура, Неопределено
//    * Тип - Строка
//
Функция НовыйОтвет()
	
	Ответ = Новый Структура;
	Ответ.Вставить("Заголовки", Новый Массив);
	Ответ.Вставить("КодСостояния", 0);
	Ответ.Вставить("Контент", Неопределено);
	Ответ.Вставить("Тип", "");
	Возврат Ответ;
	
КонецФункции

// Конструктор нового описания тела запроса.
//
// Возвращаемое значение:
//  Структура:
//    * Контент - Структура, Неопределено
//    * Обязательный - Булево
//    * Тип - Строка
//
Функция НовыйТелоЗапроса()
	
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("Контент", Неопределено);
	ТелоЗапроса.Вставить("Обязательный", Ложь);
	ТелоЗапроса.Вставить("Тип", "");
	Возврат ТелоЗапроса;
	
КонецФункции

#КонецОбласти

// Проверяет версию стандарта из схемы на предмет ее поддержки в подсистеме.
//
// Параметры:
//  ВерсияСтандарта - Строка
//
// Возвращаемое значение:
//  Булево
//
Функция ВерсияСтандартаПоддерживается(ВерсияСтандарта)
	
	Возврат СхемыHTTPСервисовПовтИсп.ЭтоВерсияСтандарта_3_0_3(ВерсияСтандарта)
		ИЛИ СхемыHTTPСервисовПовтИсп.ЭтоВерсияСтандарта_3_0_4(ВерсияСтандарта);
	
КонецФункции

// Возвращает значение свойства схемы с учетом внутренних ссылок.
//
// Параметры:
//  Схема - Соответствие
//  Компоненты - Соответствие, Неопределено
//  Свойство - Строка
//  ЗначениеПоУмолчанию - Произвольный
//
// Возвращаемое значение:
//  Произвольный
//
Функция ЗначениеСвойстваСхемы(Схема, Компоненты, Свойство, ЗначениеПоУмолчанию = Неопределено)
	
	Ссылка = Коллекции.ЗначениеСвойстваСоответствия(Схема, "$ref");
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Если НЕ ЗначениеЗаполнено(Компоненты) Тогда
			Шаблон = НСтр("ru = 'Не удалось получить значение %1. В схеме отсутствует описание блока components.'");
			ОписаниеОшибки = СтрШаблон(Шаблон, Ссылка);
			ВызватьИсключение(ОписаниеОшибки);
		КонецЕсли;
		
		ФрагментыСсылки = СтрРазделить(Ссылка, "/", Ложь);
		
		Если ФрагментыСсылки.Количество() <> 4 ИЛИ ФрагментыСсылки[0] <> "#" Тогда
			Шаблон = НСтр("ru = 'Не удалось получить значение %1. Не правильная ссылка на компонент.'");
			ОписаниеОшибки = СтрШаблон(Шаблон, Ссылка);
			ВызватьИсключение(ОписаниеОшибки);
		КонецЕсли;
		
		Значение = Коллекции.ЗначениеСвойстваСоответствия(
			Компоненты, ФрагментыСсылки[2]);
		
		Если Значение = Неопределено Тогда
			Шаблон = НСтр("ru = 'Не удалось получить значение %1. В схеме отсутствует описание блока components/%2.'");
			ОписаниеОшибки = СтрШаблон(Шаблон, Ссылка, ФрагментыСсылки[2]);
			ВызватьИсключение(ОписаниеОшибки);
		КонецЕсли;
		
		ВложенноеЗначение = Коллекции.ЗначениеСвойстваСоответствия(
			Значение, ФрагментыСсылки[3]);
		
		Если ВложенноеЗначение = Неопределено Тогда
			Шаблон = НСтр("ru = 'Не удалось получить значение %1. В схеме отсутствует описание компонента.'");
			ОписаниеОшибки = СтрШаблон(Шаблон, Ссылка);
			ВызватьИсключение(ОписаниеОшибки);
		КонецЕсли;
		
		Возврат ЗначениеСвойстваСхемы(ВложенноеЗначение, Компоненты, Свойство, ЗначениеПоУмолчанию);
	КонецЕсли;
	
	Возврат Коллекции.ЗначениеСвойстваСоответствия(
		Схема, Свойство, ЗначениеПоУмолчанию);
	
КонецФункции

// Читает данные в формате JSON.
//
// Параметры:
//  Данные - Строка
//
// Возвращаемое значение:
//  Массив, Соответствие
//
Функция ПрочитатьДанныеJSON(Данные)
	
	Параметры = СериализацияДанных.ПараметрыЧтенияJSON();
	Параметры.ПрочитатьВСоответствие = Истина;
	Возврат СериализацияДанных.ПрочитатьДанныеJSON(Данные, Параметры);
	
КонецФункции

// Сериализует схему OpenAPI в формат 1С.
//
// Параметры:
//  Схема - Соответствие
//
// Возвращаемое значение:
//  Соответствие
//
Функция СериализоватьСхемуOpenAPI(Схема)
	
	ВерсияСтандарта = ЗначениеСвойстваСхемы(Схема, Неопределено, "openapi");
	
	Если НЕ ВерсияСтандартаПоддерживается(ВерсияСтандарта) Тогда
		ОписаниеОшибки = СтрШаблон(НСтр("ru = 'Версия стандарта OpenAPI %1 не поддерживается.'"), ВерсияСтандарта);
		ВызватьИсключение(ОписаниеОшибки);
	КонецЕсли;
	
	Схема1С = Новый Соответствие;
	Компоненты = ЗначениеСвойстваСхемы(Схема, Неопределено, "components");
	Пути = ЗначениеСвойстваСхемы(Схема, Компоненты, "paths");
	
	Для Каждого Путь Из Пути Цикл
		Для Каждого Метод Из Путь.Значение Цикл
			HTTPСервис = НовыйHTTPСервис();
			ЗаполнитьHTTPСервис(ВерсияСтандарта, Метод.Значение, Компоненты, HTTPСервис, Метод.Ключ, Путь.Ключ);
			Схема1С.Вставить(HTTPСервис.Идентификатор, HTTPСервис);
		КонецЦикла;
	КонецЦикла;
	
	Возврат Схема1С;
	
КонецФункции

#КонецОбласти
