#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс
	
Функция СоздатьКонтрагента(ОписаниеКонтрагента) Экспорт
	
	Контрагент = СоздатьЭлемент();
	Контрагент.Заполнить(ОписаниеКонтрагента);
	Если Не Контрагент.ПроверитьЗаполнение() Тогда
		ТекстШаблонаОшибки = НСтр("ru='Не удалось записать контрагента %1 с ИНН %2'");
		ТекстОшибки = СтрШаблон(ТекстШаблонаОшибки, ОписаниеКонтрагента.Наименование, ОписаниеКонтрагента.ИНН);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Контрагент.Записать();
	
КонецФункции

Функция АктивныеКонтрагенты() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Example_Контрагенты.Наименование КАК Наименование,
	|	Example_Контрагенты.ИНН КАК ИНН,
	|	Example_Контрагенты.КПП КАК КПП
	|ИЗ
	|	Справочник.Example_Контрагенты КАК Example_Контрагенты
	|ГДЕ
	|	НЕ Example_Контрагенты.Недействителен
	|	И НЕ Example_Контрагенты.ЭтоГруппа
	|	И НЕ Example_Контрагенты.ПометкаУдаления";
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

#КонецОбласти

#КонецЕсли

