
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает идентификаторы HTTP-сервисов из схемы.
//
// Параметры:
//  СхемаHTTPСервисов - СправчникСсылка.СхемыHTTPСервисов
//
// Возвращаемое значение:
//  Массив из Строка
//
Функция ИдентификаторыСхемы(СхемаHTTPСервисов) Экспорт
	
	Схемы = Схемы(СхемаHTTPСервисов);
	
	Если Схемы = Неопределено Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Идентификаторы = Новый Массив;
	
	Для Каждого Схема Из Схемы Цикл
		Идентификаторы.Добавить(Схема.Ключ);
	КонецЦикла;
	
	Возврат Идентификаторы;
	
КонецФункции

// Возвращает описание схемы HTTP-сервиса по его идентификатору.
//
// Параметры:
//  СхемаHTTPСервисов - СправчникСсылка.СхемыHTTPСервисов
//  Идентификатор - Строка
//
// Возвращаемое значение:
//  Структура, Неопределено
//
Функция СхемаПоИдентификатору(СхемаHTTPСервисов, Идентификатор) Экспорт
	
	Схемы = Схемы(СхемаHTTPСервисов);
	Возврат Коллекции.ЗначениеСвойстваСоответствия(Схемы, Идентификатор);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает описание схем HTTP-сервисов.
//
// Параметры:
//  СхемаHTTPСервисов - СправчникСсылка.СхемыHTTPСервисов
//
// Возвращаемое значение:
//  - Соответствие, Неопределено
//
Функция Схемы(СхемаHTTPСервисов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СхемаHTTPСервисов", СхемаHTTPСервисов);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СхемыHTTPСервисов.Схема1С КАК Схема1С
		|ИЗ
		|	Справочник.СхемыHTTPСервисов КАК СхемыHTTPСервисов
		|ГДЕ
		|	СхемыHTTPСервисов.Ссылка = &СхемаHTTPСервисов
		|	И НЕ СхемыHTTPСервисов.ПометкаУдаления
		|	И НЕ СхемыHTTPСервисов.ЭтоГруппа";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Схема1С.Получить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
