
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

// Контекст обработчика.
Перем Контекст;

#КонецОбласти

#Область ПрограммныйИнтерфейс

#Область Ответ

// Добавляет заголовок ответа.
//
// Параметры:
//  Имя - Строка - Имя заголовка
//  Значение - Строка, Число, Булево - Значение заголовка
//
// Возвращаемое значение:
//  ОбработкаОбъект.ОбработчкиHTTPСервисОтвета - Конструктор
//
Функция ДобавитьЗаголовок(Имя, Значение) Экспорт
	
	Контекст.Ответ.Заголовки.Вставить(Имя, Значение);
	Возврат ЭтотОбъект;
	
КонецФункции

// Добавляет заголовки ответа.
//
// Параметры:
//  Заголовки - Структура, Соответствие - Заголовки
//    * Ключ - Строка - Имя заголовка
//    * Значение - Строка, Число, Булево - Значение заголовка
//
// Возвращаемое значение:
//  ОбработкаОбъект.ОбработчкиHTTPСервисОтвета - Конструктор
//
Функция ДобавитьЗаголовки(Заголовки) Экспорт
	
	Для Каждого Заголовок Из Заголовки Цикл
		ДобавитьЗаголовок(Заголовок.Ключ, Заголовок.Значение);
	КонецЦикла;
	
	Возврат ЭтотОбъект;
	
КонецФункции

// Устанавливает код состояния ответа и его расшифровку.
//
// Параметры:
//  КодСостояния - Число - Код состояния
//  Причина - Строка - Расшифровка кода состояния
//
// Возвращаемое значение:
//  ОбработкаОбъект.ОбработчкиHTTPСервисОтвета - Конструктор
//
Функция УстановитьКодСостояния(КодСостояния, Причина = "") Экспорт
	
	Контекст.Ответ.КодСостояния = КодСостояния;
	Контекст.Ответ.Причина = Причина;
	Возврат ЭтотОбъект;
	
КонецФункции

// Устанавливает тело ответа из двоичных данных.
//
// Параметры:
//  Тело - ДвоичныеДанные - Тело ответа в виде двоичных данных
//  ДобавитьЗаголовокПоУмолчанию - Булево - Добавить заголовок "Content-Type" со значением "application/octet-stream"
//
// Возвращаемое значение:
//  ОбработкаОбъект.ОбработчкиHTTPСервисОтвета - Конструктор
//
Функция УстановитьТелоИзДвоичныхДанных(Тело, ДобавитьЗаголовокПоУмолчанию = Ложь) Экспорт
	
	Контекст.Ответ.ТелоКакДвоичныеДанные = Тело;
	Контекст.Ответ.ТелоКакОбъект = Неопределено;
	Контекст.Ответ.ТелоКакСтрока = "";
	
	Если ДобавитьЗаголовокПоУмолчанию Тогда
		ДобавитьЗаголовок("Content-Type", "application/octet-stream");
	КонецЕсли;
	
	Возврат ЭтотОбъект;
	
КонецФункции

// Устанавливает тело ответа из строки.
//
// Параметры:
//  Тело - Строка - Тело ответа в виде строки
//  ДобавитьЗаголовокПоУмолчанию - Булево - Добавить заголовок "Content-Type" со значением "text/plain; charset=utf-8"
//
// Возвращаемое значение:
//  ОбработкаОбъект.ОбработчкиHTTPСервисОтвета - Конструктор
//
Функция УстановитьТелоИзСтроки(Тело, ДобавитьЗаголовокПоУмолчанию = Ложь) Экспорт
	
	Контекст.Ответ.ТелоКакДвоичныеДанные = Неопределено;
	Контекст.Ответ.ТелоКакОбъект = Неопределено;
	Контекст.Ответ.ТелоКакСтрока = Тело;
	
	Если ДобавитьЗаголовокПоУмолчанию Тогда
		ДобавитьЗаголовок("Content-Type", "text/plain; charset=utf-8");
	КонецЕсли;
	
	Возврат ЭтотОбъект;
	
КонецФункции

// Устанавливает тело ответа из сериализуемого объекта JSON.
//
// Параметры:
//  Тело - Массив, Структура, Соответствие - Тело ответа в виде объекта
//  ДобавитьЗаголовокПоУмолчанию - Булево - Добавить заголовок "Content-Type" со значением "application/json; charset=utf-8"
//
// Возвращаемое значение:
//  ОбработкаОбъект.ОбработчкиHTTPСервисОтвета - Конструктор
//
Функция УстановитьТелоИзОбъекта(Тело, ДобавитьЗаголовокПоУмолчанию = Ложь) Экспорт
	
	Контекст.Ответ.ТелоКакДвоичныеДанные = Неопределено;
	Контекст.Ответ.ТелоКакОбъект = Тело;
	Контекст.Ответ.ТелоКакСтрока = "";
	
	Если ДобавитьЗаголовокПоУмолчанию Тогда
		ДобавитьЗаголовок("Content-Type", "application/json; charset=utf-8");
	КонецЕсли;
	
	Возврат ЭтотОбъект;
	
КонецФункции

#КонецОбласти

#Область Ошибки

// Добавляет ошибку клиента.
// Данный тип ошибки будет интерпретирован в ответе как код состояния 400.
//
// Параметры:
//  Текст - Строка - Описание ошибки
//
// Возвращаемое значение:
//  ОбработкаОбъект.ОбработчкиHTTPСервисОтвета - Конструктор
//
Функция ДобавитьОшибкуКлиента(Текст) Экспорт
	
	Контекст.ОшибкиКлиента.Добавить(Текст);
	Возврат ЭтотОбъект;
	
КонецФункции

// Добавляет ошибку прав доступа.
// Данный тип ошибки будет интерпретирован в ответе как код состояния 403.
//
// Параметры:
//  Текст - Строка - Описание ошибки
//
// Возвращаемое значение:
//  ОбработкаОбъект.ОбработчкиHTTPСервисОтвета - Конструктор
//
Функция ДобавитьОшибкуПравДоступа(Текст) Экспорт
	
	Контекст.ОшибкиПравДоступа.Добавить(Текст);
	Возврат ЭтотОбъект;
	
КонецФункции

// Добавляет ошибку сервера.
// Данный тип ошибки будет интерпретирован в ответе как код состояния 500.
//
// Параметры:
//  Текст - Строка - Описание ошибки
//
// Возвращаемое значение:
//  ОбработкаОбъект.ОбработчкиHTTPСервисОтвета - Конструктор
//
Функция ДобавитьОшибкуСервера(Текст) Экспорт
	
	Контекст.ОшибкиСервера.Добавить(Текст);
	Возврат ЭтотОбъект;
	
КонецФункции

// Проверяет наличие ошибок клиента, сервера или прав доступа.
//
// Возвращаемое значение:
//  Булево - Есть ошибки
//
Функция ЕстьОшибки() Экспорт
	
	Возврат Контекст.ОшибкиКлиента.Количество() > 0
		ИЛИ Контекст.ОшибкиПравДоступа.Количество() > 0
		ИЛИ Контекст.ОшибкиСервера.Количество() > 0;
	
КонецФункции

// Возвращает коллекцию ошибок клиента, сервера и прав доступа.
//
// Возвращаемое значение:
//  ФиксированныйМассив из Строка - Ошибки
//
Функция Ошибки() Экспорт
	
	Ошибки = Новый Массив;
	
	Для Каждого Элемент Из Контекст.ОшибкиКлиента Цикл
		Ошибки.Добавить(Элемент);
	КонецЦикла;
	
	Для Каждого Элемент Из Контекст.ОшибкиПравДоступа Цикл
		Ошибки.Добавить(Элемент);
	КонецЦикла;
	
	Для Каждого Элемент Из Контекст.ОшибкиСервера Цикл
		Ошибки.Добавить(Элемент);
	КонецЦикла;
	
	Возврат Коллекции.ФиксироватьКоллекцию(Ошибки);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Инициализирует контектс обработчика HTTP-сервис ответа.
//
// Параметры:
//  ВходящийКонтекст - Структура
//
Процедура Инициализировать(ВходящийКонтекст) Экспорт
	
	Контекст = ВходящийКонтекст;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
