
#Область СлужебныйПрограммныйИнтерфейс

// Записывает данные в JSON.
// В случае ошибки выбрасывает исключение.
//
// Параметры:
//  Значение - Массив, Структура, Соответствие - Сериализуемое значение
//  Параметры - см. СериализацияДанных.ПараметрыЗаписиJSON
//
// Возвращаемое значение:
//  Строка - Строка в формате JSON
//
Функция ЗаписатьДанныеJSON(Значение, Параметры = Неопределено) Экспорт
	
	ВариантЗаписиДаты = Коллекции.ЗначениеСвойстваСтруктуры(
		Параметры, "ВариантЗаписиДаты", ВариантЗаписиДатыJSON.ЛокальнаяДата);
	ФорматСериализацииДаты = Коллекции.ЗначениеСвойстваСтруктуры(
		Параметры, "ФорматСериализацииДаты", ФорматДатыJSON.ISO);
	СериализовыватьМассивыКакОбъекты = Коллекции.ЗначениеСвойстваСтруктуры(
		Параметры, "СериализовыватьМассивыКакОбъекты", Ложь);
	ИмяФункцииПреобразования = Коллекции.ЗначениеСвойстваСтруктуры(
		Параметры, "ИмяФункцииПреобразования");
	МодульФункцииПреобразования = Коллекции.ЗначениеСвойстваСтруктуры(
		Параметры, "МодульФункцииПреобразования");
	ДополнительныеПараметрыФункцииПреобразования = Коллекции.ЗначениеСвойстваСтруктуры(
		Параметры, "ДополнительныеПараметрыФункцииПреобразования");
	ИспользоватьДвойныеКавычки = Коллекции.ЗначениеСвойстваСтруктуры(
		Параметры, "ИспользоватьДвойныеКавычки", Истина);
	ПереносСтрок = Коллекции.ЗначениеСвойстваСтруктуры(
		Параметры, "ПереносСтрок", ПереносСтрокJSON.Авто);
	СимволыОтступа = Коллекции.ЗначениеСвойстваСтруктуры(
		Параметры, "СимволыОтступа", "");
	ЭкранированиеСимволов = Коллекции.ЗначениеСвойстваСтруктуры(
		Параметры, "ЭкранированиеСимволов", ЭкранированиеСимволовJSON.Нет);
	ЭкранироватьАмперсанд = Коллекции.ЗначениеСвойстваСтруктуры(
		Параметры, "ЭкранироватьАмперсанд", Ложь);
	ЭкранироватьОдинарныеКавычки = Коллекции.ЗначениеСвойстваСтруктуры(
		Параметры, "ЭкранироватьОдинарныеКавычки", Ложь);
	ЭкранироватьРазделителиСтрок = Коллекции.ЗначениеСвойстваСтруктуры(
		Параметры, "ЭкранироватьРазделителиСтрок", Истина);
	ЭкранироватьСлеш = Коллекции.ЗначениеСвойстваСтруктуры(
		Параметры, "ЭкранироватьСлеш", Ложь);
	ЭкранироватьУгловыеСкобки = Коллекции.ЗначениеСвойстваСтруктуры(
		Параметры, "ЭкранироватьУгловыеСкобки", Ложь);
	
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(
		ПереносСтрок, СимволыОтступа, ИспользоватьДвойныеКавычки,
		ЭкранированиеСимволов, ЭкранироватьУгловыеСкобки,
		ЭкранироватьРазделителиСтрок, ЭкранироватьАмперсанд,
		ЭкранироватьОдинарныеКавычки, ЭкранироватьСлеш);
	
	НастройкиСериализацииJSON = Новый НастройкиСериализацииJSON;
	НастройкиСериализацииJSON.ВариантЗаписиДаты = ВариантЗаписиДаты;
	НастройкиСериализацииJSON.ФорматСериализацииДаты = ФорматСериализацииДаты;
	НастройкиСериализацииJSON.СериализовыватьМассивыКакОбъекты = СериализовыватьМассивыКакОбъекты;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	ЗаписатьJSON(ЗаписьJSON, Значение, НастройкиСериализацииJSON,
		ИмяФункцииПреобразования, МодульФункцииПреобразования,
		ДополнительныеПараметрыФункцииПреобразования);
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

// Конструктор новых параметров для записи данных в JSON.
//
// Возвращаемое значение:
//  Структура - Параметры записи JSON:
//    * ВариантЗаписиДаты - ВариантЗаписиДатыJSON - Вариант записи даты, по умолчанию "ЛокальнаяДата" (ГГГГ-ММ-ДДTЧЧ:ММ:СС)
//    * ФорматСериализацииДаты - ФорматДатыJSON - Формат сериализации даты, по умолчанию "ISO" (ГГГГ-ММ-ДДTЧЧ:ММ:ССZ)
//    * СериализовыватьМассивыКакОбъекты - Булево - Сериализовывать массивы как объекты
//    * ИмяФункцииПреобразования - Строка - Имя экспортной функции преобразования
//    * МодульФункцииПреобразования - Произвольный - Модуль функции преобразования
//    * ДополнительныеПараметрыФункцииПреобразования - Произвольный - Дополнительные параметры функции преобразования
//    * ИспользоватьДвойныеКавычки - Булево - Использовать двойные кавычки, по умолчанию "Истина"
//    * ПереносСтрок - ПереносСтрокJSON - Символ переноса строки, по умолчанию  "Авто"
//    * СимволыОтступа - Строка - Символы отступа
//    * ЭкранированиеСимволов - ЭкранированиеСимволовJSON - Способо экранирования символов, по умолчанию "Нет"
//    * ЭкранироватьАмперсанд - Булево - Экранировать амперсанд
//    * ЭкранироватьОдинарныеКавычки - Булево - Экранировать одинарные кавычки
//    * ЭкранироватьРазделителиСтрок - Булево - Экранировать разделители строк, по умолчанию "Истина"
//    * ЭкранироватьСлеш - Булево - Экранировать слеш
//    * ЭкранироватьУгловыеСкобки - Булево - Экранировать угловые скобки
//
Функция ПараметрыЗаписиJSON() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("ВариантЗаписиДаты", ВариантЗаписиДатыJSON.ЛокальнаяДата);
	Параметры.Вставить("ФорматСериализацииДаты", ФорматДатыJSON.ISO);
	Параметры.Вставить("СериализовыватьМассивыКакОбъекты", Ложь);
	Параметры.Вставить("ИмяФункцииПреобразования");
	Параметры.Вставить("МодульФункцииПреобразования");
	Параметры.Вставить("ДополнительныеПараметрыФункцииПреобразования");
	Параметры.Вставить("ИспользоватьДвойныеКавычки", Истина);
	Параметры.Вставить("ПереносСтрок", ПереносСтрокJSON.Авто);
	Параметры.Вставить("СимволыОтступа", "");
	Параметры.Вставить("ЭкранированиеСимволов", ЭкранированиеСимволовJSON.Нет);
	Параметры.Вставить("ЭкранироватьАмперсанд", Ложь);
	Параметры.Вставить("ЭкранироватьОдинарныеКавычки", Ложь);
	Параметры.Вставить("ЭкранироватьРазделителиСтрок", Истина);
	Параметры.Вставить("ЭкранироватьСлеш", Ложь);
	Параметры.Вставить("ЭкранироватьУгловыеСкобки", Ложь);
	Возврат Параметры;
	
КонецФункции

// Конструктор новых параметров для чтения данных из JSON.
//
// Возвращаемое значение:
//  Структура - Параметры чтения JSON:
//    * ПрочитатьВСоответствие - Булево - Прочитать в соответствие
//    * ИменаСвойствСоЗначениямиДата - Массив из Строка - Имена свойств со значениями дата
//    * ОжидаемыйФорматДаты - ФорматДатыJSON - Формат сериализации даты, по умолчанию "ISO" (ГГГГ-ММ-ДДTЧЧ:ММ:ССZ)
//    * ИмяФункцииВосстановления - Строка - Имя экспортной функции восстановления
//    * МодульФункцииВосстановления - Произвольный - Модуль функции восстановления
//    * ДополнительныеПараметрыФункцииВосстановления - Произвольный - Дополнительные параметры функции восстановления
//    * ИменаСвойствДляОбработкиВосстановления - Массив из Строка - Имена свойств для обработки восстановления
//    * МаксимальнаяВложенность - Число - Максимальная вложенность, по умолчанию "500"
//
Функция ПараметрыЧтенияJSON() Экспорт
	
	ПараметрыЧтенияJSON = Новый Структура;
	ПараметрыЧтенияJSON.Вставить("ПрочитатьВСоответствие", Ложь);
	ПараметрыЧтенияJSON.Вставить("ИменаСвойствСоЗначениямиДата", Новый Массив);
	ПараметрыЧтенияJSON.Вставить("ОжидаемыйФорматДаты", ФорматДатыJSON.ISO);
	ПараметрыЧтенияJSON.Вставить("ИмяФункцииВосстановления");
	ПараметрыЧтенияJSON.Вставить("МодульФункцииВосстановления");
	ПараметрыЧтенияJSON.Вставить("ДополнительныеПараметрыФункцииВосстановления");
	ПараметрыЧтенияJSON.Вставить("ИменаСвойствДляОбработкиВосстановления", Новый Массив);
	ПараметрыЧтенияJSON.Вставить("МаксимальнаяВложенность", 500);
	Возврат ПараметрыЧтенияJSON;
	
КонецФункции

// Читает данные из JSON.
// В случае ошибки выбрасывает исключение.
//
// Параметры:
//  СтрокаJSON - Строка - Строка в формате JSON
//  Параметры - см. СериализацияДанных.ПараметрыЧтенияJSON
//
// Возвращаемое значение:
//  Массив, Структура, Соответствие - Сериализованное значение
//
Функция ПрочитатьДанныеJSON(СтрокаJSON, Параметры = Неопределено) Экспорт
	
	ПрочитатьВСоответствие = Коллекции.ЗначениеСвойстваСтруктуры(
		Параметры, "ПрочитатьВСоответствие", Ложь);
	ИменаСвойствСоЗначениямиДата = Коллекции.ЗначениеСвойстваСтруктуры(
		Параметры, "ИменаСвойствСоЗначениямиДата");
	ОжидаемыйФорматДаты = Коллекции.ЗначениеСвойстваСтруктуры(
		Параметры, "ОжидаемыйФорматДаты", ФорматДатыJSON.ISO);
	ИмяФункцииВосстановления = Коллекции.ЗначениеСвойстваСтруктуры(
		Параметры, "ИмяФункцииВосстановления");
	МодульФункцииВосстановления = Коллекции.ЗначениеСвойстваСтруктуры(
		Параметры, "МодульФункцииВосстановления");
	ДополнительныеПараметрыФункцииВосстановления = Коллекции.ЗначениеСвойстваСтруктуры(
		Параметры, "ДополнительныеПараметрыФункцииВосстановления");
	ИменаСвойствДляОбработкиВосстановления = Коллекции.ЗначениеСвойстваСтруктуры(
		Параметры, "ИменаСвойствДляОбработкиВосстановления");
	МаксимальнаяВложенность = Коллекции.ЗначениеСвойстваСтруктуры(
		Параметры, "МаксимальнаяВложенность", 500);
	
	Если Коллекции.ЭтоМассив(ИменаСвойствСоЗначениямиДата)
			И ИменаСвойствСоЗначениямиДата.Количество() = 0 Тогда
		ИменаСвойствСоЗначениямиДата = Неопределено;
	КонецЕсли;
	
	Если Коллекции.ЭтоМассив(ИменаСвойствДляОбработкиВосстановления)
			И ИменаСвойствДляОбработкиВосстановления.Количество() = 0 Тогда
		ИменаСвойствДляОбработкиВосстановления = Неопределено;
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	Возврат ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие,
		ИменаСвойствСоЗначениямиДата, ОжидаемыйФорматДаты,
		ИмяФункцииВосстановления, МодульФункцииВосстановления,
		ДополнительныеПараметрыФункцииВосстановления, ИменаСвойствДляОбработкиВосстановления,
		МаксимальнаяВложенность);
	
КонецФункции

#КонецОбласти
