
#Область ОбработчикиСобытий

Функция Echo(HTTPСервисЗапрос)
	
	HTTPСервис = Справочники.HTTPСервисы.Echo;
	Возврат HTTPСервисЗапросы.ОбработатьЗапрос(HTTPСервисЗапрос, HTTPСервис); 
	
КонецФункции

Функция GetContragents(HTTPСервисЗапрос)
	
	HTTPСервис = Справочники.HTTPСервисы.GetContragents;
	Возврат HTTPСервисЗапросы.ОбработатьЗапрос(HTTPСервисЗапрос, HTTPСервис);
	
КонецФункции

Функция GetContracts(HTTPСервисЗапрос)
	
	HTTPСервис = Справочники.HTTPСервисы.GetContracts;
	Возврат HTTPСервисЗапросы.ОбработатьЗапрос(HTTPСервисЗапрос, HTTPСервис);
	
КонецФункции

Функция CreateContragent(HTTPСервисЗапрос)
	
	HTTPСервис = Справочники.HTTPСервисы.CreateContragent;
	Возврат HTTPСервисЗапросы.ОбработатьЗапрос(HTTPСервисЗапрос, HTTPСервис);
	
КонецФункции

#КонецОбласти
