
#Область ПрограммныйИнтерфейс

// Переопределяемый метод для добавления обработчиков запросов.
// Обработчики запросов предназначены для реализации бизнес-логики.
//
// Параметры:
//  Обработчики - ТаблицаЗначения - Обработчики запросов:
//    * HTTPСервис - СправочникСсылка.HTTPСервисы - HTTP-сервис
//    * ВПривилегированномРежиме - Булево - Выполнить обработчик в привилегированном режиме
//    * ВТранзакции - Булево - Выполнить обработчик в транзакции
//    * Обработчик - Строка - Путь к экспортной процедуре обработки запроса
//
// Пример:
//  Процедура ПриДобавленииОбработчиковЗапросов(Обработчики) Экспорт
//      Обработчик = Обработчики.Добавить();
//      Обработчик.HTTPСервис = Справочники.HTTPСервисы.Demo;
//      Обработчик.Обработчик = "ОбработчикиHTTPСервисЗапросов.ОбработатьЗапросDemo";
//  КонецПроцедуры
//  
//  Процедура ОбработатьЗапросDemo(ОбработчкиЗапроса, ОбработчикОтвета) Экспорт
//  КонецПроцедуры
//
Процедура ПриДобавленииОбработчиковЗапросов(Обработчики) Экспорт
	
	ОбработчикиHTTPСервисЗапросов.ПриДобавленииОбработчиковЗапросов(Обработчики);
	
КонецПроцедуры

// Переопределяемый метод для добавления обработчиков проверки запросов.
// Обработчики проверки запросов предназначены для дополнительной проверки запроса.
//
// Параметры:
//  Обработчики - ТаблицаЗначения - Обработчики проверки запросов:
//    * HTTPСервис - СправочникСсылка.HTTPСервисы - HTTP-сервис
//    * ВПривилегированномРежиме - Булево - Выполнить обработчик в привилегированном режиме
//    * ВТранзакции - Булево - Выполнить обработчик в транзакции
//    * Обработчик - Строка - Путь к экспортной процедуре обработки проверки запроса
//
// Пример:
//  Процедура ПриДобавленииОбработчиковПроверкиЗапросов(Обработчики) Экспорт
//      Обработчик = Обработчики.Добавить();
//      Обработчик.HTTPСервис = Справочники.HTTPСервисы.Demo;
//      Обработчик.Обработчик = "ОбработчикиHTTPСервисЗапросов.ПроверитьЗапросDemo";
//  КонецПроцедуры
//  
//  Процедура ПроверитьЗапросDemo(ОбработчикЗапроса, ОбработчкиОтвета) Экспорт
//  КонецПроцедуры
//
Процедура ПриДобавленииОбработчиковПроверкиЗапросов(Обработчики) Экспорт
	
	ОбработчикиHTTPСервисЗапросов.ПриДобавленииОбработчиковПроверкиЗапросов(Обработчики);
	
КонецПроцедуры

// Переопределяемый метод для добавления обработчиков проверки ответов.
// Обработчики проверки ответов предназначены для дополнительной проверки ответа.
//
// Параметры:
//  Обработчики - ТаблицаЗначения - Обработчики проверки ответов:
//    * HTTPСервис - СправочникСсылка.HTTPСервисы - HTTP-сервис
//    * ВПривилегированномРежиме - Булево - Выполнить обработчик в привилегированном режиме
//    * ВТранзакции - Булево - Выполнить обработчик в транзакции
//    * Обработчик - Строка - Путь к экспортной процедуре обработки проверки ответа
//
// Пример:
//  Процедура ПриДобавленииОбработчиковПроверкиОтветов(Обработчики) Экспорт
//      Обработчик = Обработчики.Добавить();
//      Обработчик.HTTPСервис = Справочники.HTTPСервисы.Demo;
//      Обработчик.Обработчик = "ОбработчикиHTTPСервисЗапросов.ПроверитьОтветDemo";
//  КонецПроцедуры
//  
//  Процедура ПроверитьОтветDemo(ОбработчикЗапроса, ОбработчикОтвета) Экспорт
//  КонецПроцедуры
//
Процедура ПриДобавленииОбработчиковПроверкиОтветов(Обработчики) Экспорт
	
	ОбработчикиHTTPСервисЗапросов.ПриДобавленииОбработчиковПроверкиОтветов(Обработчики);
	
КонецПроцедуры

// Переопределяемый метод для добавления обработчиков проверки прав доступа.
// Обработчики проверки прав доступа предназначены для проверки прав доступа.
//
// Параметры:
//  Обработчики - ТаблицаЗначения - Обработчики проверки прав доступа:
//    * HTTPСервис - СправочникСсылка.HTTPСервисы - HTTP-сервис
//    * ВПривилегированномРежиме - Булево - Выполнить обработчик в привилегированном режиме
//    * ВТранзакции - Булево - Выполнить обработчик в транзакции
//    * Обработчик - Строка - Путь к экспортной процедуре обработки проверки ответа
//
// Пример:
//  Процедура ПриДобавленииОбработчиковПроверкиПравДоступа(Обработчики) Экспорт
//      Обработчик = Обработчики.Добавить();
//      Обработчик.HTTPСервис = Справочники.HTTPСервисы.Demo;
//      Обработчик.Обработчик = "ОбработчикиHTTPСервисЗапросов.ПроверитьПраваДоступаDemo";
//  КонецПроцедуры
//  
//  Процедура ПроверитьПраваДоступаDemo(ОбработчикЗапроса, ОбработчикОтвета) Экспорт
//  КонецПроцедуры
//
Процедура ПриДобавленииОбработчиковПроверкиПравДоступа(Обработчики) Экспорт
	
	ОбработчикиHTTPСервисЗапросов.ПриДобавленииОбработчиковПроверкиПравДоступа(Обработчики);
	
КонецПроцедуры

#КонецОбласти
